[
  {
    "title": "Inception",
    "genre": "Sci-Fi",
    "releaseYear": "Jul. 16, 2010",
    "director": "Christopher Nolan",
    "cast": "Leonardo DiCaprio, Joseph Gordon-Levitt",
    "rating": 8.8,
    "duration": 148,
    "plotSummary": "Dom Cobb is an expert thief who can extract secrets from people's dreams. However, haunted by the death of his wife and unable to be with his children, he struggles with guilt and personal loss. Cobb is offered a chance to redeem himself by performing the impossible: inception, the act of planting an idea into someone’s subconscious mind rather than stealing it. Assembling a team of specialists including an architect, a forger, and a chemist, Cobb enters multi-layered dreams, navigating complex dreamscapes where time flows differently and reality becomes increasingly unstable. Each layer presents escalating psychological and emotional challenges. Cobb’s team must overcome subconscious defenses, deal with projections of Cobb’s own guilt, and execute precise timing to succeed. Throughout the journey, themes of memory, grief, morality, and the human mind’s fragility are explored. The film examines the boundaries between reality and illusion, exploring how emotions and memories shape human perception. Cobb confronts his deepest fears while guiding his team, leading to a resolution that blends action, suspense, and profound psychological insights. The story is a high-stakes heist within the mind, reflecting both external and internal struggles of human consciousness, morality, and redemption.",
    "posterUrl": "https://upload.wikimedia.org/wikipedia/en/2/2e/Inception_%282010%29_theatrical_poster.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:00:00Z"
  },
  {
    "title": "The Dark Knight",
    "genre": "Action",
    "releaseYear": "Jul. 18, 2008",
    "director": "Christopher Nolan",
    "cast": "Christian Bale, Heath Ledger",
    "rating": 9.0,
    "duration": 152,
    "plotSummary": "In Gotham City, crime and corruption are rampant despite Batman’s vigilant efforts. The city faces a new threat in the form of the Joker, a chaotic mastermind who uses psychological manipulation to create fear, anarchy, and moral dilemmas. Batman struggles to uphold justice without compromising his ethical code while navigating complex relationships with allies like District Attorney Harvey Dent and Commissioner Gordon. The Joker orchestrates crimes that challenge the morality of Gotham’s citizens and push Batman to the edge of his own limits. As the narrative unfolds, themes of justice, morality, chaos, heroism, and human vulnerability are explored in depth. Characters face personal conflicts, ethical choices, and the consequences of their actions, emphasizing the tension between order and anarchy. The film presents a layered narrative blending action, suspense, and psychological drama. The Joker’s unpredictability forces Batman to confront his fears and responsibilities while testing the resilience of Gotham City itself. Through thrilling confrontations and morally complex situations, the story examines the cost of heroism, the fine line between good and evil, and the enduring impact of choices on individuals and society.",
    "posterUrl": "https://upload.wikimedia.org/wikipedia/en/1/1c/The_Dark_Knight_%282008_film%29.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:01:00Z"
  },
  {
    "title": "Interstellar",
    "genre": "Adventure",
    "releaseYear": "Nov. 7, 2014",
    "director": "Christopher Nolan",
    "cast": "Matthew McConaughey, Anne Hathaway",
    "rating": 8.6,
    "duration": 169,
    "plotSummary": "In the near future, Earth faces environmental collapse, with food shortages and climate instability threatening humanity’s survival. Cooper, a former NASA pilot, is recruited to lead a critical mission to explore distant planets for potential human habitation. Alongside Dr. Amelia Brand and other scientists, he travels through a newly discovered wormhole near Saturn, encountering planets with extreme conditions and unforeseen dangers. As time dilation and other relativistic effects complicate their journey, the crew confronts life-or-death challenges that test their endurance, intellect, and emotional strength. Cooper’s relationship with his daughter Murph forms a central emotional arc, highlighting themes of love, sacrifice, and the human drive to secure a future for the next generation. Ethical dilemmas arise as decisions about survival, exploration, and the fate of humanity must be made under pressure. The film explores the interconnection of human relationships, science, and the vast unknowns of space. Through visually stunning depictions of otherworldly landscapes and scientifically grounded scenarios, the narrative emphasizes perseverance, hope, and the enduring human spirit. Interstellar is both an epic space adventure and a profound exploration of time, family, and the moral dimensions of scientific discovery, challenging characters and viewers alike to consider the weight of their choices and the scope of human ambition.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSngBJ0B7UDrLUkDlp6DCQLsEYuWR-DiHwbnxFFCniB3HiP3f3NZmR1-lKSC34ge6YXu4LX&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:02:00Z"
  },
  {
    "title": "The Matrix",
    "genre": "Action",
    "releaseYear": "Mar. 31, 1999",
    "director": "The Wachowskis",
    "cast": "Keanu Reeves, Laurence Fishburne",
    "rating": 8.7,
    "duration": 136,
    "plotSummary": "Neo, a skilled hacker, senses that reality is not what it seems. Morpheus reveals that the world is a simulated reality called the Matrix, controlled by sentient machines that enslave humanity. Believed to be ‘The One,’ Neo trains to harness his abilities within this digital world. As he confronts powerful agents and manipulates the rules of the Matrix, Neo’s understanding of identity, freedom, and destiny deepens. Alongside Trinity and other rebels, he navigates a complex web of danger, deception, and philosophical challenges. The film explores themes of reality versus illusion, personal empowerment, choice, and human potential. Neo’s journey is both external and internal, encompassing high-stakes action, emotional growth, and moral questioning. As he confronts the oppressive system and his own fears, Neo’s evolution challenges notions of fate, self-determination, and the boundaries between man and machine. The story blends cyberpunk aesthetics, philosophical inquiry, and innovative action sequences to create a narrative that is intellectually stimulating and emotionally resonant, emphasizing the struggle for autonomy and truth in a controlled and deceptive world.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQCWXVvfvZR3oe7PCMM0exwV0dObOTKvLfSM-bjvKpQ1VegKXuCtq6aBrxqbIgUNxMbfavy&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:03:00Z"
  },
  {
    "title": "Fight Club",
    "genre": "Drama",
    "releaseYear": "Oct. 15, 1999",
    "director": "David Fincher",
    "cast": "Brad Pitt, Edward Norton",
    "rating": 8.8,
    "duration": 139,
    "plotSummary": "An insomniac office worker, struggling with feelings of emptiness and disillusionment, encounters Tyler Durden, a charismatic soap salesman. Together, they create Fight Club, an underground group where men release their frustrations through bare-knuckle fighting. As the club evolves, it transforms into Project Mayhem, a revolutionary movement challenging societal norms and corporate control. The narrator confronts his own fractured psyche while grappling with identity, masculinity, and consumerism. Themes of chaos, control, rebellion, and self-discovery pervade the narrative. The film explores the consequences of attempting to break free from societal expectations and the tension between individuality and conformity. Through shocking revelations, psychological complexity, and intense action, the story examines human nature, relationships, and moral ambiguity. The characters’ journeys are both physical and emotional, addressing the struggle for meaning, freedom, and authenticity in a conformist world. Fight Club challenges viewers to question the social, personal, and ethical boundaries that govern behavior, highlighting the fragility and resilience of the human mind and the consequences of unchecked desires and inner turmoil.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ_SpVkWXBnRsBBNbDaV8dur-3jlOi6fepmxBrYGkzDwHj-xtDGP4jySn7xvonE9lqNpBdRWg&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:04:00Z"
  },
  {
    "title": "Pulp Fiction",
    "genre": "Crime",
    "releaseYear": "Oct. 14, 1994",
    "director": "Quentin Tarantino",
    "cast": "John Travolta, Uma Thurman",
    "rating": 8.9,
    "duration": 154,
    "plotSummary": "Pulp Fiction weaves multiple stories of crime, redemption, and moral ambiguity in Los Angeles. Hitmen Vincent Vega and Jules Winnfield navigate dangerous underworld situations while engaging in philosophical dialogue that highlights their complex personalities. Meanwhile, boxer Butch Coolidge faces betrayal and survival, and other characters’ lives intersect in unexpected ways. The nonlinear narrative explores themes of fate, consequence, loyalty, and human nature. Through dark humor, shocking violence, and character-driven storytelling, the film examines the ripple effects of individual actions across a morally complex society. Relationships are tested, choices carry weight, and redemption is juxtaposed against criminality. Tarantino’s film challenges viewers to piece together the sequence of events while exploring the ethical and existential dimensions of crime, morality, and survival. Pulp Fiction blends suspense, dialogue, and stylistic filmmaking with intricate character arcs, emphasizing how ordinary actions can have extraordinary consequences in a world governed by chance, choice, and circumstance.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSCqzGSUVlP74iyuFujryxWBYV6yqGirkn7BFHIJXEMzS4gNI-Z2wEKZsW6dLYA9B77BgyPdg&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:05:00Z"
  },
  {
    "title": "The Shawshank Redemption",
    "genre": "Drama",
    "releaseYear": "Sep. 23, 1994",
    "director": "Frank Darabont",
    "cast": "Tim Robbins, Morgan Freeman",
    "rating": 9.3,
    "duration": 142,
    "plotSummary": "Andy Dufresne, wrongfully convicted of murder, is sent to Shawshank State Penitentiary, where he faces brutality, corruption, and the harsh realities of prison life. Through intelligence, perseverance, and hope, he forms alliances with fellow inmates, improves the prison library, and helps staff with financial matters. Andy’s long-term strategy to achieve freedom involves patience, cunning, and moral reflection, emphasizing themes of resilience, redemption, and the human spirit’s capacity to endure injustice. His friendship with Red provides emotional depth, illustrating trust, mentorship, and personal growth. The narrative explores how hope, ingenuity, and ethical action can transform lives, even within oppressive systems. Over decades, Andy navigates personal and institutional challenges, balancing survival with self-actualization. The story’s layered exploration of friendship, loyalty, oppression, and liberation underscores the profound impact of individual determination, while also offering commentary on morality, justice, and the redemptive power of human resilience.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSf1DK32xKMQzqSl8wnY1BLVu_gdwsRYzVSNM6A03r6c-fEwrif8raKzkFRuerw1KHdDICvOw&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:06:00Z"
  },
  {
    "title": "Forrest Gump",
    "genre": "Drama",
    "releaseYear": "Jul. 6, 1994",
    "director": "Robert Zemeckis",
    "cast": "Tom Hanks, Robin Wright",
    "rating": 8.8,
    "duration": 142,
    "plotSummary": "Forrest Gump, a man with limited intelligence but an extraordinary heart, recounts his life story filled with remarkable achievements and adventures. From excelling in football to heroically serving in Vietnam, starting a successful shrimp business, and inadvertently influencing major historical events, Forrest’s journey demonstrates the interplay of destiny, chance, and perseverance. His unwavering love for Jenny shapes his emotional narrative, highlighting themes of loyalty, devotion, and personal growth. The film blends humor, pathos, and historical context to examine the human capacity for resilience, kindness, and impact. Forrest’s innocence and simplicity allow him to navigate complex social, political, and emotional landscapes. Throughout his life, he experiences triumphs, losses, and pivotal moments that reveal the interconnectedness of individuals and history. The story underscores the importance of love, hope, and determination, illustrating how one individual’s journey can inspire and shape the lives of others, while offering a poignant reflection on the unpredictability and beauty of life.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTNI2SBzYW95C8Wo7zYV3bzVzem58xPnUzsZGLsnLg17mSMgR574acQZpgNK7a5XeF3THjqgQ&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:07:00Z"
  },
  {
    "title": "The Godfather",
    "genre": "Crime",
    "releaseYear": "Mar. 24, 1972",
    "director": "Francis Ford Coppola",
    "cast": "Marlon Brando, Al Pacino",
    "rating": 9.2,
    "duration": 175,
    "plotSummary": "The Godfather follows the Corleone family, a powerful crime dynasty in post-war New York. Patriarch Vito Corleone navigates loyalty, power, and family while balancing legitimate and illegitimate enterprises. His youngest son, Michael, initially uninvolved, is gradually drawn into the family’s criminal empire. The story explores ambition, betrayal, honor, and moral compromise, showing Michael’s transformation from reluctant outsider to strategic and ruthless leader. Political maneuvering, violent confrontations, and familial obligations illustrate the tension between personal morality and survival in a criminal world. The narrative delves into the consequences of choices, the weight of power, and the complex dynamics of loyalty and legacy. Themes of family, corruption, ethics, and the human condition are interwoven into a cinematic experience that combines dramatic storytelling with deep character exploration. The film portrays the cost of ambition and crime, offering insight into the interplay between personal desires, familial duty, and societal influence.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQAY2xsJVIZxm3K0gNtOMr9CSCvLdr5kdo3V3pv2HMuUkTBhFzRe5-b8NDRmO1mt5S5Xp_YyQ&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:08:00Z"
  },
  {
    "title": "The Flash",
    "genre": "Action",
    "releaseYear": "Jun. 16, 2023",
    "director": "Andy Muschietti",
    "cast": "Ezra Miller, Michael Keaton",
    "rating": 6.2,
    "duration": 144,
    "plotSummary": "Barry Allen, a young forensic scientist, discovers that he possesses superhuman speed, which allows him to move faster than the eye can see. Motivated by the desire to correct past tragedies, especially the death of his mother, Barry tests the limits of his powers and learns about the consequences of altering the timeline. As he traverses alternate realities, he encounters multiple versions of familiar heroes and villains, each with their own motivations and perspectives. The story explores themes of causality, personal responsibility, and ethical dilemmas associated with changing the past. Barry’s journey is fraught with emotional challenges, as he struggles to reconcile his longing for redemption with the impact of his actions on the multiverse. Throughout the narrative, he must collaborate with allies to restore balance and prevent catastrophic disruptions across time and space. High-octane action sequences are interwoven with personal drama, as Barry confronts grief, guilt, and heroism. The film delves into the psychological and emotional consequences of power, emphasizing that even superhuman abilities come with moral and existential responsibilities. Ultimately, Barry learns that true heroism lies not only in strength and speed but in understanding, sacrifice, and the courage to face consequences, both personal and universal.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRlTCLSubZKO6c7ZFrKQPRBx5-RR6OnThjbEvA2SJsht8BqyJrFE3Zu-tx-AHlKOfZEY_ji&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:09:00Z"
  },
   {
    "title": "Ant-Man and the Wasp: Quantumania",
    "genre": "Action",
    "releaseYear": "Feb. 17, 2023",
    "director": "Peyton Reed",
    "cast": "Paul Rudd, Evangeline Lilly",
    "rating": 6.1,
    "duration": 124,
    "plotSummary": "Scott Lang, also known as Ant-Man, and Hope van Dyne, the Wasp, embark on an adventurous mission into the Quantum Realm, a microscopic universe with unusual physics, bizarre landscapes, and time-distorted areas. The duo faces unexpected challenges, including a dangerous villain who seeks to exploit the Quantum Realm for personal gain, threatening reality itself. Along the way, they confront the complexities of heroism, teamwork, and moral responsibility. The narrative explores courage, ingenuity, and the consequences of meddling with forces beyond human understanding. Scott and Hope navigate intricate tunnels, encounter strange inhabitants, and solve complex problems that test both intelligence and emotional resilience. Humor and personal stakes are interwoven with science fiction spectacle, highlighting the balance between adventure and human emotion. As they face life-threatening situations, they must rely on their wits, resourcefulness, and trust in each other. Themes of empowerment, unity, and ethical responsibility permeate the story, emphasizing that even in fantastical circumstances, decisions carry weight. Through dynamic action sequences and character development, the film demonstrates how courage, collaboration, and perseverance can overcome extraordinary challenges, showcasing the fusion of heroism and adventure in a visually imaginative world.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTDJQkj0ulGUOn1wpYDvxv6HsOz0pY0T2y6rKmua1lXoBs6Ym9tOYhFjRRXnJ2Zwg4lVBbRiQ&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:10:00Z"
  },
  {
    "title": "Guardians of the Galaxy Vol. 3",
    "genre": "Action",
    "releaseYear": "May 5, 2023",
    "director": "James Gunn",
    "cast": "Chris Pratt, Zoe Saldana",
    "rating": 8.1,
    "duration": 150,
    "plotSummary": "The Guardians of the Galaxy, a team of intergalactic misfits, face new challenges as they confront a formidable threat endangering one of their own. They journey through unfamiliar planets, encounter alien civilizations, and grapple with the consequences of past decisions. Each member must reconcile personal conflicts while leveraging unique abilities to protect the galaxy. Themes of family, redemption, sacrifice, and the meaning of heroism in a vast universe are explored in depth. High-energy action, inventive technology, and emotional storytelling combine to create a narrative that balances humor, suspense, and heartfelt moments. The Guardians confront both external adversaries and internal struggles, testing loyalty, trust, and resilience. Character growth is central, emphasizing how teamwork and interpersonal bonds can overcome overwhelming odds. The narrative examines moral choices, responsibility, and the transformative power of friendship and collaboration. As the team unites against cosmic dangers, they discover that true strength arises from trust, unity, and courage, rather than individual abilities alone. The story celebrates the complexity of relationships and the enduring impact of personal sacrifice in the pursuit of greater good.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRkyKX8165zgrg_ded57Dq66MKQsx7K8VNHyCB4u7Kbm5qJgv5Sh6WO-oPi2oCnsVbsRicm&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:11:00Z"
  },
  {
    "title": "Oppenheimer",
    "genre": "Biography",
    "releaseYear": "Jul. 21, 2023",
    "director": "Christopher Nolan",
    "cast": "Cillian Murphy, Emily Blunt",
    "rating": 8.5,
    "duration": 180,
    "plotSummary": "Oppenheimer chronicles the life of physicist J. Robert Oppenheimer, who leads the Manhattan Project, the top-secret World War II effort to develop the atomic bomb. The film explores his intellectual brilliance, moral dilemmas, and personal struggles amid intense political and scientific pressures. Relationships with colleagues, government officials, and family are portrayed to emphasize both triumphs and sacrifices. The narrative delves into the ethical implications of creating a weapon of mass destruction and the profound psychological effects on those involved. As Oppenheimer navigates secrecy, ambition, and moral responsibility, he confronts the long-lasting consequences of scientific advancement. The story highlights the tension between innovation and ethics, showcasing how extraordinary talent can shape history while posing moral challenges. Through detailed character development and historical context, the film examines ambition, guilt, leadership, and accountability. Audiences witness Oppenheimer’s internal conflicts, decision-making under pressure, and the burden of knowledge that carries the power to alter humanity’s fate. The narrative combines history, human drama, and moral inquiry, emphasizing the profound responsibilities inherent in scientific discovery and the enduring impact of choices made under extraordinary circumstances.",
    "posterUrl": "https://upload.wikimedia.org/wikipedia/en/4/4a/Oppenheimer_%28film%29.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:12:00Z"
  },
  {
    "title": "John Wick: Chapter 4",
    "genre": "Action",
    "releaseYear": "Mar. 24, 2023",
    "director": "Chad Stahelski",
    "cast": "Keanu Reeves, Donnie Yen",
    "rating": 8.0,
    "duration": 169,
    "plotSummary": "John Wick, a legendary former hitman, continues his relentless pursuit against the High Table, a powerful criminal organization seeking his demise. Facing deadly assassins, complex codes of conduct, and intricate underworld politics, John must navigate a series of high-stakes challenges. The narrative explores vengeance, loyalty, and the consequences of a life immersed in violence. John’s relationships, both past and present, complicate his mission, as he confronts moral dilemmas and the emotional toll of relentless combat. Each encounter is choreographed to blend intense action with cinematic spectacle. As John uncovers hidden truths, he relies on tactical skill, strategic planning, and resilience to survive. Themes of honor, determination, and justice permeate the story, alongside the psychological burden of constant threat. The film examines the human drive to protect loved ones, maintain agency, and seek closure in a world defined by danger and ethical ambiguity. John Wick’s journey emphasizes courage, perseverance, and the costs of living under relentless adversity, combining thrilling action with character-driven storytelling that highlights both external and internal conflicts.",
    "posterUrl": "https://upload.wikimedia.org/wikipedia/en/d/d0/John_Wick_-_Chapter_4_promotional_poster.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:13:00Z"
  },
  {
    "title": "Barbie",
    "genre": "Adventure",
    "releaseYear": "Jul. 21, 2023",
    "director": "Greta Gerwig",
    "cast": "Margot Robbie, Ryan Gosling",
    "rating": 7.0,
    "duration": 114,
    "plotSummary": "Barbie, an iconic character from Barbie Land, embarks on a transformative adventure into the real world, discovering challenges, cultural nuances, and complex human relationships. The narrative explores identity, self-acceptance, and the contrast between fantasy and reality. Barbie encounters diverse characters, humorous situations, and unexpected obstacles that test her creativity, resilience, and adaptability. Themes of empowerment, personal growth, and authenticity are central, highlighting the importance of embracing individuality and human imperfection. As she navigates this unfamiliar world, Barbie learns lessons about friendship, courage, and self-awareness. The story combines comedy, fantasy, and heartfelt moments to provide a rich, entertaining, and thought-provoking experience. Through vibrant visuals, witty dialogue, and imaginative scenarios, Barbie reconciles her idealized identity with real-world complexities, emphasizing personal transformation, the value of ethical choices, and the power of imagination. Ultimately, her journey demonstrates that fulfillment comes from meaningful connections, resilience, and the courage to embrace change, blending humor, fantasy, and introspection in a narrative that resonates with both children and adults.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcROuK_Bl8jrLUP7fo3hsDC4XC2AC1WR1CAXS3G1SVqDPZE0pgFTQKnr8P2_cKmRuXg03nPE&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:14:00Z"
  },
  {
    "title": "Mission: Impossible – Dead Reckoning Part One",
    "genre": "Action",
    "releaseYear": "Jul. 12, 2023",
    "director": "Christopher McQuarrie",
    "cast": "Tom Cruise, Rebecca Ferguson",
    "rating": 7.6,
    "duration": 163,
    "plotSummary": "Ethan Hunt, a highly skilled operative, faces a global threat requiring precision, bravery, and ingenuity. Tasked with preventing catastrophic events orchestrated by a mysterious adversary, Hunt assembles a team to undertake dangerous missions worldwide. The story features high-stakes espionage, elaborate schemes, and daring stunts, emphasizing courage, trust, and moral responsibility. Hunt navigates deception, betrayal, and life-threatening situations, balancing personal sacrifice with global duty. The narrative explores themes of loyalty, resilience, and strategic decision-making under extreme pressure. Relationships with allies and adversaries are tested, highlighting teamwork, ingenuity, and ethical dilemmas inherent in espionage. The film blends suspense, action, and narrative complexity, showcasing both physical prowess and intellectual acumen. Each mission challenges Hunt to adapt, think critically, and overcome extraordinary obstacles. Through carefully choreographed action sequences and intense character-driven storytelling, the story examines heroism, the consequences of choices, and the relentless pursuit of justice and protection of innocent lives. Ethan Hunt’s journey reflects both the physical and moral challenges of being a hero in a modern world fraught with danger and uncertainty.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR34_otMSvSpe1Nn8Iip4kpkcaAHrUGaIITwQYC9iRIL4q34rHhTY2cTYrbRe303iD5fdsm&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:15:00Z"
  },
  {
    "title": "Transformers: Rise of the Beasts",
    "genre": "Action",
    "releaseYear": "Jun. 9, 2023",
    "director": "Steven Caple Jr.",
    "cast": "Anthony Ramos, Dominique Fishback",
    "rating": 6.8,
    "duration": 127,
    "plotSummary": "Humans and Autobots confront a new threat from the Maximals and Predacons, ancient Transformers whose arrival disrupts the world’s balance. The story follows human allies navigating alliances, danger, and ethical responsibilities alongside the Autobots. Led by Optimus Prime, the team faces challenges that test courage, teamwork, and moral principles. The narrative explores loyalty, heroism, and the importance of collaboration in overcoming overwhelming threats. Characters encounter spectacular environments, advanced technology, and life-threatening scenarios, emphasizing strategy, ingenuity, and ethical decision-making. Action-packed sequences are complemented by emotional development, character growth, and interpersonal dynamics. Themes of trust, perseverance, and resilience pervade the story, highlighting the stakes of protecting both humanity and sentient robotic civilizations. The film balances science fiction spectacle with human emotion, creating a compelling narrative of courage, morality, and the triumph of cooperation against formidable adversaries.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSEsFNeH_1HnJrtVLrbLdsdamTUTZwn7Kj9YBsSWiUHR4shBKafAY89uQwV_A0Z3Chj_ahPIA&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:16:00Z"
  },
  {
    "title": "The Marvels",
    "genre": "Action",
    "releaseYear": "Nov. 10, 2023",
    "director": "Nia DaCosta",
    "cast": "Brie Larson, Iman Vellani",
    "rating": 7.1,
    "duration": 105,
    "plotSummary": "Carol Danvers, Kamala Khan, and Monica Rambeau join forces to confront a cosmic threat endangering Earth and the universe. Each hero brings unique abilities, perspectives, and experiences, requiring trust, strategic collaboration, and coordinated effort. The story explores empowerment, teamwork, and moral responsibility, highlighting how individual strengths can combine to overcome adversity. As they navigate interstellar landscapes, face alien adversaries, and tackle personal struggles, the characters develop trust, resilience, and courage. The narrative balances high-stakes action with character-driven storytelling, emphasizing ethical dilemmas and the weight of power. Themes of perseverance, unity, and heroism permeate the story, illustrating the importance of empathy, strategic thinking, and moral integrity. Through visually compelling sequences and emotional depth, the film demonstrates how collaboration, self-awareness, and personal growth are essential in overcoming challenges, showcasing heroism not just as power, but as responsibility, courage, and the ability to protect others while maintaining ethical principles.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRr2CHFXhorQkI9wP5KMf290fdqX7eRnl95P_BddZBIEuCqOAI7FYUnILfgo_ovnCK4ppeQyA&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:17:00Z"
  },
  {
    "title": "Wonka",
    "genre": "Adventure",
    "releaseYear": "Dec. 15, 2023",
    "director": "Paul King",
    "cast": "Timothée Chalamet, Olivia Colman",
    "rating": 7.5,
    "duration": 115,
    "plotSummary": "A young Willy Wonka embarks on a magical journey to establish his legendary chocolate factory. The story explores his inventive genius, curiosity, and imagination, highlighting both the sweetness and challenges of ambition. Wonka encounters fantastical characters, whimsical landscapes, and extraordinary obstacles that test creativity, resilience, and ethical decision-making. Themes of self-discovery, ambition, friendship, and responsibility are central, illustrating how imagination, morality, and perseverance shape extraordinary achievements. Wonka learns important lessons about the impact of actions, human connection, and ethical choices while navigating his path to success. The narrative blends humor, adventure, and fantasy, creating an immersive experience that emphasizes the transformative power of creativity, determination, and dreams. Through vibrant storytelling and inventive scenarios, Wonka’s journey celebrates imagination, personal growth, and the joy of exploring new possibilities, demonstrating that ambition coupled with integrity can bring delight and meaningful contributions to the world.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRrtRJVKVEsmsaq7eHik9Euw6hBfwEAwg_MmlBnp9013_31mmP6Ehp5rDyQ8-Ycr6ePyHVR&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:18:00Z"
  },
  {
    "title": "Spider-Man: No Way Home",
    "genre": "Action",
    "releaseYear": "Dec. 17, 2021",
    "director": "Jon Watts",
    "cast": "Tom Holland, Zendaya",
    "rating": 8.4,
    "duration": 148,
    "plotSummary": "After Peter Parker's secret identity as Spider-Man is revealed, he faces enormous public scrutiny, legal consequences, and threats to those he loves. Hoping to restore his normal life, Peter seeks Doctor Strange's help, asking him to cast a spell to make everyone forget he is Spider-Man. However, the spell goes wrong, breaking the barriers between universes and causing villains from alternate timelines to enter his world. Peter is forced to confront powerful adversaries from previous Spider-Man universes, each presenting unique challenges that push his intellect, courage, and morality to the limit. Alongside allies such as MJ, Ned, and other familiar faces, he navigates intense battles, complex strategies, and emotional turmoil. The story examines themes of responsibility, sacrifice, identity, and the moral weight of power. Peter must make life-altering decisions, learning that heroism requires selflessness, resilience, and the willingness to confront insurmountable odds. Through action, emotion, and interdimensional conflict, the narrative explores growth, trust, and the consequences of choice, ultimately highlighting the essence of true courage and leadership in a chaotic world.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSoBbV1cm1zPYG83x9vhcuLqS7zoD8Al52Bu-lGNIBk_q2r2yD3sOxV_oZwerMbBwZXVfse8Q&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:19:00Z"
  },
  {
    "title": "The Batman",
    "genre": "Action",
    "releaseYear": "Jun. 13, 2025",
    "director": "Matt Reeves",
    "cast": "Robert Pattinson, Zoë Kravitz",
    "rating": 8.2,
    "duration": 176,
    "plotSummary": "Batman investigates Gotham City's underworld to uncover corruption and confront a serial killer known as the Riddler, whose cryptic crimes expose the city's darkest secrets. As Bruce Wayne delves deeper, he encounters political intrigue, systemic failure, and layers of deception that challenge his detective skills and moral judgment. The story examines his dual identity, highlighting the psychological toll of trauma, guilt, and the relentless pursuit of justice. Relationships with allies, including Catwoman, Commissioner Gordon, and Alfred, are tested and strengthened as he navigates moral dilemmas and dangerous adversaries. Themes of vigilantism, accountability, redemption, and justice are central, revealing Batman as both a hero and a man wrestling with personal and societal consequences. The narrative combines noir-style suspense, action, and character-driven drama, portraying the Dark Knight's struggle to balance vengeance with responsibility, ultimately illustrating courage, resilience, and the fight against corruption.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRIMCpS3OjmxGAhuR99vetHATrUSMK2Cih6TB10Dnk9op5yB-y4DEVQsw9h3814Z8MirrCe&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:20:00Z"
  },
  {
    "title": "Avatar 2: The Way of Water",
    "genre": "Action",
    "releaseYear": "Jun. 13, 2021",
    "director": "James Cameron",
    "cast": "Sam Worthington, Zoe Saldaña",
    "rating": 7.8,
    "duration": 192,
    "plotSummary": "Jake Sully and Neytiri strive to protect their family and homeland from renewed human threats seeking to exploit Pandora’s resources. As their children grow, the family must navigate environmental hazards, interspecies conflicts, and ethical dilemmas in defending their way of life. They explore underwater realms, encounter unique creatures, and uncover ancient secrets, testing courage, ingenuity, and resilience. The narrative emphasizes themes of family, loyalty, ecological responsibility, and the consequences of colonization. Conflicts intensify as human invaders employ advanced technology, forcing the Na’vi to strategize, innovate, and rely on trust and unity. The story blends breathtaking visual spectacle with emotional depth, exploring identity, leadership, and interconnectedness. Through perilous journeys, epic battles, and poignant moments, the characters learn to balance personal bonds with the greater duty to protect their planet, emphasizing sacrifice, courage, and perseverance in the face of overwhelming odds.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSxTA7S2fDMhUDVcZnuxuie2xE_ayntCdkCKme3EK3ObKXFuhdaLhYYTpzUHZ45-IQzQt6T&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:21:00Z"
  },
  {
    "title": "Thor: Love and Thunder",
    "genre": "Action",
    "releaseYear": "Jun. 23, 2025",
    "director": "Taika Waititi",
    "cast": "Chris Hemsworth, Natalie Portman",
    "rating": 6.9,
    "duration": 119,
    "plotSummary": "Thor embarks on a journey to find inner peace while confronting both old allies and new cosmic threats. He must reconcile past failures, fractured relationships, and personal insecurities with the responsibilities of heroism. When a formidable new enemy emerges, Thor reunites with old friends, facing challenges that test his strength, courage, and moral judgment. Alongside Jane Foster, who wields Mjolnir, Thor navigates cosmic realms, uncovers hidden truths, and confronts complexities of power and leadership. The narrative explores themes of identity, self-discovery, love, and resilience, blending humor, epic battles, and heartfelt moments. Thor learns that true strength lies not only in physical power but in emotional intelligence, compassion, and the courage to face the unknown, illustrating personal growth and heroism in the vast cosmos.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQJ2BeC2ZXEyd0AAxWlwlrfbkc7uCgtL6o5A0b7PPCO1HxAuHp0Upa2SOkFEXFQc8TXFoND&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:22:00Z"
  },
  {
    "title": "Doctor Strange in the Multiverse of Madness",
    "genre": "Action",
    "releaseYear": "Jun. 13, 2020",
    "director": "Sam Raimi",
    "cast": "Benedict Cumberbatch, Elizabeth Olsen",
    "rating": 7.0,
    "duration": 126,
    "plotSummary": "Doctor Strange faces unprecedented threats across the multiverse after a spell intended to help a friend goes awry, destabilizing multiple realities. Dangerous beings from alternate dimensions appear, forcing Strange to confront moral dilemmas and the limits of his magical powers. With Wanda Maximoff, the Scarlet Witch, as an ally, he navigates fractured timelines, encounters twisted versions of familiar figures, and fights to restore balance. The story examines responsibility, power, sacrifice, and the far-reaching consequences of every choice. As Strange journeys through mind-bending realms and battles formidable adversaries, he must reconcile personal ambition with the greater good. The narrative combines suspense, action, horror, and deep emotional arcs, illustrating the complexity of heroism in a universe where every action can have monumental effects. Through trials, strategy, and courage, Doctor Strange learns that wisdom, humility, and selflessness are essential for true heroism.",
    "posterUrl": "https://m.media-amazon.com/images/M/MV5BN2YxZGRjMzYtZjE1ZC00MDI0LThjZmQtZTZmMzVmMmQ2NzBmXkEyXkFqcGc@._V1_FMjpg_UX1000_.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:23:00Z"
  },
  {
    "title": "Black Adam",
    "genre": "Action",
    "releaseYear": "Jun. 12, 2023",
    "director": "Jaume Collet-Serra",
    "cast": "Dwayne Johnson, Pierce Brosnan",
    "rating": 6.5,
    "duration": 125,
    "plotSummary": "Black Adam, an ancient antihero empowered by mystical forces, emerges in the modern world after centuries of imprisonment. Seeking vengeance against those who wronged him, he challenges the established order of heroes and rulers. As he confronts the Justice Society of America and other powerful figures, moral and ethical dilemmas arise, testing his judgment and strategy. The narrative explores the ambiguity of power, justice, and responsibility, illustrating the thin line between heroism and tyranny. Through intense battles, supernatural feats, and personal introspection, Black Adam navigates conflicts that demand both force and wisdom. Themes of legacy, consequence, and the morality of power are central, emphasizing how personal conviction and the pursuit of justice can lead to complex decisions. The story blends action, supernatural elements, and philosophical depth, portraying a character wrestling with purpose, vengeance, and the responsibilities inherent in immense strength.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSnPpH-fjh4jBWgEaQw_xiUy3WQl0088Pl6KcCwFlCZhBkQSPspou7oDQRubwza_hE7_XszIg&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:24:00Z"
  },
  {
    "title": "Everything Everywhere All at Once",
    "genre": "Action",
    "releaseYear": "Jun. 13, 2025",
    "director": "Daniel Kwan, Daniel Scheinert",
    "cast": "Michelle Yeoh, Ke Huy Quan",
    "rating": 8.0,
    "duration": 139,
    "plotSummary": "Evelyn, an ordinary woman, discovers she is connected to infinite versions of herself across countless universes. Thrust into chaos, she navigates parallel realities and faces a mysterious force threatening existence itself. As she explores alternate lives, she gains unique skills, insights, and emotional resilience, understanding the impact of her choices and relationships. Alongside her family, Evelyn confronts moral dilemmas, surreal adversaries, and existential challenges. The story intertwines comedy, action, and philosophical reflection, exploring themes of identity, meaning, family, and the interconnectedness of existence. Through trials, growth, and self-discovery, she learns to embrace multiple selves, make profound decisions, and appreciate love, purpose, and human potential. The narrative blends absurdist humor, visual spectacle, and emotional depth, emphasizing courage, empathy, and the transformative power of choice.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRW6n0N5NVFJhglILQYRF9hswb8iQ4lOw3cF2Qy7pH9aRPLZEnGW9cUbWYhyqTko_VJL7D8zQ&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:25:00Z"
  },
  {
    "title": "No Time to Die",
    "genre": "Action",
    "releaseYear": "Jun. 03, 2015",
    "director": "Cary Joji Fukunaga",
    "cast": "Daniel Craig, Rami Malek",
    "rating": 7.3,
    "duration": 163,
    "plotSummary": "James Bond, retired from active service, is drawn back into dangerous action when a new global threat emerges, endangering millions. Facing Lyutsifer Safin, a ruthless villain with advanced technology and personal vendettas, Bond must overcome both physical and psychological challenges. The story explores themes of loyalty, sacrifice, and the toll of a life in espionage. Navigating alliances, betrayal, and perilous missions, Bond balances duty and personal stakes while protecting loved ones. The narrative combines high-octane action, complex planning, and tense confrontations with introspective moments, illustrating the human side of a legendary agent. Bond's resilience, courage, and strategic mind are tested as he confronts moral dilemmas and reconciles his past with the pressing dangers of the present, highlighting heroism and the consequences of choices in a life lived on the edge.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTc7ssFT_S1H_U4_4WaUlBRNk6atWDYW9-BzDYY5JaopYPvLs0wvAQreo08HJ1pw65i7LAJZg&s=10",
    "language": "English",
    "country": "UK",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:26:00Z"
  },
  {
    "title": "Dune",
    "genre": "Adventure",
    "releaseYear": "Jun. 13, 2025",
    "director": "Denis Villeneuve",
    "cast": "Timothée Chalamet, Zendaya",
    "rating": 8.1,
    "duration": 155,
    "plotSummary": "Paul Atreides, a young noble with unique abilities, is thrust into a dangerous world when his family assumes control of the desert planet Arrakis, the only source of the universe's valuable spice. Facing betrayal, assassination attempts, and interstellar conflict, Paul must harness intellect, leadership, and emerging mystical powers to survive. He navigates complex political intrigue and cultural tensions with the Fremen, the planet's indigenous people. The narrative examines destiny, loyalty, honor, and the weight of prophecy, exploring Paul's growth and ethical challenges. Through strategic battles, alliances, and personal reflection, Paul learns to balance ambition with compassion, shaping the fate of Arrakis and influencing the universe. The story blends philosophical depth, epic visuals, and intense action, portraying human ambition, identity, and the responsibilities of power.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSt7xlJEzb-xopDqcQ6iw9SbY8PAlJN8H7DYUzTqmZkwLT9o8JXv6YWvDMGRKwkyRnf6RHzGg&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:27:00Z"
  },
  {
    "title": "Top Gun: Maverick",
    "genre": "Action",
    "releaseYear": "Jun. 13, 2015",
    "director": "Joseph Kosinski",
    "cast": "Tom Cruise, Miles Teller",
    "rating": 8.4,
    "duration": 131,
    "plotSummary": "Captain Pete 'Maverick' Mitchell, now a seasoned Navy pilot, is tasked with training a new generation of elite fighter pilots for a high-stakes mission that demands exceptional skill, courage, and leadership. Maverick must confront his past, unresolved conflicts, and the legacy of fallen comrades while mentoring the young pilots, including the son of his late friend Goose. The story explores themes of courage, responsibility, personal growth, and the evolution of heroism. Maverick faces intense aerial combat exercises, real-world dangers, and high-pressure decision-making that test his expertise and emotional resilience. Relationships with protégés, colleagues, and former allies reveal the human side of military service. Through daring maneuvers, strategic thinking, and personal reflection, Maverick demonstrates innovation, resilience, and the ability to confront fear and adversity. The narrative combines thrilling flight sequences with emotional depth, emphasizing mentorship, teamwork, and the enduring pursuit of excellence, honoring the courage and sacrifice inherent in a Navy pilot’s life.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSEWEKrGjS-mQ_YGDUvlPjZQoLhZ084Cf-o2nBU7BkvZVUjJf8poO5BL0510QhJhhUxF9qK&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:28:00Z"
  },
  {
    "title": "Avatar",
    "genre": "Action",
    "releaseYear": "Jun. 18, 2025",
    "director": "James Cameron",
    "cast": "Sam Worthington, Zoe Saldana",
    "rating": 7.8,
    "duration": 162,
    "plotSummary": "Jake Sully, a paraplegic Marine, is sent to the lush alien world of Pandora to participate in the Avatar Program, which allows him to control a genetically engineered Na’vi body. Immersed in the vibrant ecosystem, he begins to understand the customs, beliefs, and way of life of the indigenous Na’vi. Initially tasked with gathering intelligence for humans seeking Pandora's resources, Jake experiences a moral conflict as he grows attached to the Na’vi people and their land. He develops a deep bond with Neytiri, a Na’vi warrior, learning the spiritual and ecological wisdom of Pandora. As human exploitation escalates, Jake leads a resistance to protect the planet from destruction. The narrative explores themes of identity, colonialism, environmental stewardship, love, and the interconnectedness of all life. Jake undergoes a profound personal transformation, balancing duty with conscience, and learning the importance of courage, leadership, and empathy. The film combines breathtaking visuals, epic action, and emotional resonance, depicting the struggle to protect what is sacred and the power of standing up for what is right.",
    "posterUrl": "https://upload.wikimedia.org/wikipedia/en/d/d6/Avatar_%282009_film%29_poster.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:29:00Z"
  },
  {
    "title": "Gladiator",
    "genre": "Action",
    "releaseYear": "May. 5, 2000",
    "director": "Ridley Scott",
    "cast": "Russell Crowe, Joaquin Phoenix",
    "rating": 8.5,
    "duration": 155,
    "plotSummary": "Maximus Decimus Meridius, a loyal Roman general, is betrayed when Commodus, the ambitious son of Emperor Marcus Aurelius, murders his father to seize the throne. Stripped of rank, enslaved, and separated from his family, Maximus is forced to fight as a gladiator in brutal arenas across the Roman Empire. Driven by vengeance and a desire for justice, he rises through the ranks, gaining the admiration of the people while plotting to confront Commodus. The story explores themes of loyalty, honor, revenge, and the corrupting influence of power. Maximus navigates political intrigue, deadly combat, and personal loss while maintaining integrity and purpose. Relationships with fellow gladiators, allies, and the people of Rome highlight his humanity. Through epic battles, strategic cunning, and moral fortitude, Maximus becomes a symbol of resistance and courage, inspiring both the oppressed and powerful. The narrative balances action, political drama, and emotional depth, illustrating the cost of ambition, the power of legacy, and the relentless pursuit of justice and redemption against overwhelming odds.",
    "posterUrl": "https://upload.wikimedia.org/wikipedia/en/f/fb/Gladiator_%282000_film_poster%29.png",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:00:00Z"
  },
  {
    "title": "Jurassic Park",
    "genre": "Action",
    "releaseYear": "Jun. 11, 1993",
    "director": "Steven Spielberg",
    "cast": "Sam Neill, Laura Dern, Jeff Goldblum",
    "rating": 8.1,
    "duration": 127,
    "plotSummary": "A visionary billionaire creates a theme park populated with genetically cloned dinosaurs, inviting scientists and guests to witness this groundbreaking experiment. Experts, including Dr. Alan Grant, Dr. Ellie Sattler, and mathematician Ian Malcolm, assess the park’s safety. When security systems fail catastrophically, the dinosaurs escape containment, thrusting the group into life-or-death struggles against prehistoric predators. The story explores human hubris, the ethical consequences of scientific advancement, and the unpredictable power of nature. Characters must rely on intelligence, courage, and teamwork to survive. The narrative combines thrilling action, scientific intrigue, and awe-inspiring encounters, emphasizing respect for nature and the limitations of human control.",
    "posterUrl": "https://upload.wikimedia.org/wikipedia/en/e/e7/Jurassic_Park_poster.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:00:00Z"
  },
  {
    "title": "Titanic",
    "genre": "Drama",
    "releaseYear": "Dec. 19, 1997",
    "director": "James Cameron",
    "cast": "Leonardo DiCaprio, Kate Winslet",
    "rating": 7.8,
    "duration": 195,
    "plotSummary": "Aboard the ill-fated RMS Titanic, Jack Dawson, a poor artist, and Rose DeWitt Bukater, a wealthy young woman engaged to a controlling fiancé, form a deep, passionate connection despite social boundaries. Their romance unfolds amidst opulence, societal pressure, and the looming disaster. As they navigate class divisions, family expectations, and personal growth, they experience joy, freedom, and emotional awakening. When the Titanic strikes an iceberg, chaos ensues, and passengers face life-or-death decisions, revealing heroism, cowardice, and humanity’s resilience. Jack and Rose confront moral dilemmas, personal sacrifice, and mortality, deepening their bond. The story explores love, fate, mortality, and contrasts between privilege and adversity, emphasizing the enduring impact of choices, courage, and connection.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRlcQXin_CNozAFkv_SSihe5eZ_lvDD5nBqCmQT3xPf6KLlqHloIo5cBRGqwuy8pjuIiZrqoA&s=10",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:00:00Z"
  },
  {
    "title": "The Avengers",
    "genre": "Action",
    "releaseYear": "May. 4, 2012",
    "director": "Joss Whedon",
    "cast": "Robert Downey Jr., Chris Evans, Scarlett Johansson",
    "rating": 8.0,
    "duration": 143,
    "plotSummary": "When Loki, a powerful alien warlord, threatens Earth using the Tesseract’s cosmic power, Nick Fury assembles the world’s greatest heroes: Iron Man, Captain America, Thor, Hulk, Black Widow, and Hawkeye. Initially struggling with personal differences and distrust, the team learns to work together to counter Loki’s plan and defend the planet. The narrative explores leadership, responsibility, heroism, and the challenges of collaboration. Each hero confronts fears, past traumas, and ethical dilemmas, forming bonds that strengthen their unity. Through epic battles, strategic teamwork, and personal growth, the Avengers become a symbol of hope and resilience, demonstrating that collective courage and cooperation can overcome seemingly insurmountable threats. The story blends action, humor, and emotional resonance, highlighting the human dimension of superhuman heroes and the power of teamwork in protecting the world from extraordinary dangers.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR37Z-peMMSYOy1gmolMUnNCVlZhEB1VKQRjrv9J6gWbkCrqo_eOca1YRUT0714n27KqbVGyx4T5FicKC9suDAi-txdkgFFRorsGYhp5vU&s",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:00:00Z"
  },
  {
    "title": "Iron Man 3",
    "genre": "Action",
    "releaseYear": "May. 3, 2013",
    "director": "James Cameron",
    "cast": "Sam Worthington, Zoe Saldaña",
    "rating": 7.7,
    "duration": 192,
    "plotSummary": "Years after the original Iron Man 3, Jake Sully and Neytiri have built a family and strive to protect Pandora while maintaining harmony with its environment. New threats force them to explore aquatic territories and interact with oceanic clans. They face ethical dilemmas, environmental hazards, and human invaders, requiring strategic thinking, courage, and unity. Themes of family, responsibility, cultural identity, and ecological stewardship are central. Relationships are tested through conflict, loss, and adaptation, highlighting resilience, courage, and collective action. The story combines breathtaking visuals, thrilling action, and emotional depth, emphasizing the bond between the Na’vi and their world. Through exploration, battles, and self-discovery, the family learns to balance personal bonds with the broader duty to protect Pandora, reinforcing sacrifice, perseverance, and the enduring fight to safeguard life.",
    "posterUrl": "https://m.media-amazon.com/images/M/MV5BMjIzMzAzMjQyM15BMl5BanBnXkFtZTcwNzM2NjcyOQ@@._V1_FMjpg_UX1000_.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user2@example.com",
    "created_at": "2025-11-11T01:00:00Z"
  },
  {
    "title": "Black Panther",
    "genre": "Action",
    "releaseYear": "Feb. 16, 2018",
    "director": "Ryan Coogler",
    "cast": "Chadwick Boseman, Michael B. Jordan",
    "rating": 7.3,
    "duration": 134,
    "plotSummary": "T’Challa, newly crowned King of Wakanda, must balance the responsibilities of monarch with those of the Black Panther. When a powerful adversary challenges his leadership and threatens Wakanda’s secrecy, T’Challa confronts personal doubts and the global consequences of his decisions. He grapples with moral dilemmas regarding power, justice, and the ethical use of advanced technology. Allies and adversaries test his vision, forcing him to grow as a leader and hero. Through intense action, political intrigue, and deeply human interactions, T’Challa learns the value of collaboration, understanding, and courage. Themes of identity, heritage, responsibility, and legacy are central, emphasizing using power for the greater good. The narrative blends superhero spectacle with nuanced social commentary, emotional depth, and thrilling action, highlighting the significance of leadership and the impact of choices on a nation and the world.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTbVjVIUH5hjvtYN7ZnXs6idhhVnbmkD_i_z-QO7hYkpZE4E11hQhf0rF4oRKU-0uVvmWw4rxqq_Z8IUfhS0dQAZyvCZ2D4iyu4rwjynME&s",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:00:00Z"
  },
  {
    "title": "Doctor Strange",
    "genre": "Action",
    "releaseYear": "Nov. 4, 2016",
    "director": "Scott Derrickson",
    "cast": "Benedict Cumberbatch, Chiwetel Ejiofor",
    "rating": 7.5,
    "duration": 115,
    "plotSummary": "Dr. Stephen Strange, a brilliant but arrogant neurosurgeon, suffers a career-ending accident that damages his hands. Desperate for recovery, he embarks on a journey of physical and spiritual transformation, leading him to Kamar-Taj and the mystic arts. Under the guidance of the Ancient One, Strange learns to manipulate magic, time, and dimensions beyond ordinary perception. Confronted by the dark sorcerer Kaecilius, who threatens Earth, Strange must overcome ego and embrace responsibility. The story explores humility, personal growth, and the balance between power and wisdom. Through intense magical battles, moral dilemmas, and profound self-discovery, Strange evolves from self-centered ambition to selfless heroism, learning the importance of courage, compassion, and ethical decision-making. The narrative combines fantasy, action, and philosophical depth, illustrating the profound impact of choice and knowledge on both personal destiny and the fate of the world.",
    "posterUrl": "https://m.media-amazon.com/images/M/MV5BNjgwNzAzNjk1Nl5BMl5BanBnXkFtZTgwMzQ2NjI1OTE@._V1_FMjpg_UX1000_.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user2@example.com",
    "created_at": "2025-11-11T01:00:00Z"
  },
  {
    "title": "Guardians of the Galaxy",
    "genre": "Action",
    "releaseYear": "Aug. 1, 2014",
    "director": "James Gunn",
    "cast": "Chris Pratt, Zoe Saldana",
    "rating": 8.0,
    "duration": 121,
    "plotSummary": "A group of intergalactic criminals, led by Peter Quill, must unite to stop Ronan, who seeks a powerful orb capable of mass destruction. Each member—Gamora, Drax, Rocket, and Groot—carries a troubled past, creating initial tension. Through shared danger, humor, and daring exploits, they form a cohesive team, learning trust, loyalty, and the value of chosen family. The narrative explores themes of friendship, sacrifice, personal growth, and redemption. As they navigate cosmic threats, deadly adversaries, and moral dilemmas, the Guardians evolve from outlaws into heroes, protecting the universe. The story blends humor, high-octane action, emotional arcs, and visual spectacle, celebrating teamwork, courage, and the transformative power of unity and redemption, demonstrating that even flawed individuals can rise to greatness through cooperation and selflessness.",
    "posterUrl": "https://m.media-amazon.com/images/M/MV5BM2ZmNjQ2MzAtNDlhNi00MmQyLWJhZDMtNmJiMjFlOWY4MzcxXkEyXkFqcGc@._V1_.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user2@example.com",
    "created_at": "2025-11-11T01:00:00Z"
  },
  {
    "title": "Doctor Who: The Movie",
    "genre": "Adventure",
    "releaseYear": "May. 14, 1996",
    "director": "Geoffrey Sax",
    "cast": "Paul McGann, Daphne Ashbrook",
    "rating": 6.2,
    "duration": 90,
    "plotSummary": "The Doctor regenerates into a new form and discovers renewed threats from his arch-nemesis, the Master, who plans to manipulate time and dominate Earth. Alongside companion Grace Holloway, the Doctor navigates temporal anomalies, decodes complex mysteries, and prevents catastrophic outcomes. The story explores identity, responsibility, and the consequences of tampering with time. As the Doctor confronts his past and the perils of regeneration, he faces moral dilemmas and the burden of protecting the universe. The narrative combines science fiction adventure, suspense, and personal drama, highlighting ingenuity, courage, and empathy. Through battles, problem-solving, and ethical challenges inherent in time travel, the Doctor balances cleverness, compassion, and action to restore order and safeguard both Earth and the timelines, providing a compelling introduction to this incarnation of the legendary Time Lord.",
    "posterUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQZt95XI-JD1diMWXtRuI0nsCdOwGsI54vu4_hKhZ8sFpD5Y1TI-1q4nGL91RJq3zHMM_MH3Q&s=10",
    "language": "English",
    "country": "UK",
    "addedBy": "user@example.com",
    "created_at": "2025-11-11T01:00:00Z"
  }
]
