[
  {
    "title": "Inception",
    "genre": "Sci-Fi",
    "releaseYear": 2010,
    "director": "Christopher Nolan",
    "cast": "Leonardo DiCaprio, Joseph Gordon-Levitt",
    "rating": 8.8,
    "duration": 148,
    "plotSummary": "Dom Cobb is a highly skilled thief and a master of extraction, a technique that allows him to enter the dreams of others and steal their deepest secrets. Haunted by the memory of his deceased wife, Cobb struggles to find peace while being a fugitive, unable to reunite with his children. When offered the opportunity to redeem himself and return home, he is tasked with performing inception: planting an idea in someone’s mind rather than stealing it. To succeed, Cobb assembles a team of specialists, including an architect to design intricate dreamscapes, a forger to assume identities within the dreams, and a chemist to concoct sedatives powerful enough to sustain multiple dream layers. As they navigate dreams within dreams, the team encounters obstacles in the form of subconscious projections, particularly manifestations of Cobb’s late wife, which threaten to sabotage the mission. Each layer of the dream presents escalating challenges, manipulating time and perception. Cobb must confront his own guilt and fears while guiding his team, blurring the line between reality and illusion. The mission becomes both a heist and a journey of personal redemption, exploring the human mind, the power of memory, and the fragility of reality.",
    "posterUrl": "https://i.ibb.co/example1.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "The Dark Knight",
    "genre": "Action, Crime, Drama",
    "releaseYear": 2008,
    "director": "Christopher Nolan",
    "cast": "Christian Bale, Heath Ledger",
    "rating": 9.0,
    "duration": 152,
    "plotSummary": "Gotham City is plagued by escalating crime despite the efforts of Batman, the masked vigilante, who has dedicated his life to justice. The arrival of the Joker, a chaotic and unpredictable criminal mastermind, throws the city into turmoil. Unlike other criminals, the Joker thrives on anarchy and psychological manipulation, orchestrating elaborate schemes to challenge the moral integrity of Gotham’s citizens and its protectors. Batman struggles to contain the chaos without compromising his ethical principles, while allies like District Attorney Harvey Dent and Lieutenant Jim Gordon fight to uphold justice within the legal system. As the Joker’s schemes intensify, he pushes Batman and the city to their limits, exposing vulnerabilities and testing the boundaries between right and wrong. Relationships are strained, loyalties are tested, and the very concept of heroism is questioned. The Joker’s unpredictability forces Batman to confront his own fears and limitations, as he navigates a series of moral dilemmas and dangerous confrontations. The narrative intertwines thrilling action, psychological tension, and ethical exploration, depicting a hero’s struggle to protect his city while maintaining his humanity in the face of overwhelming chaos and evil.",
    "posterUrl": "https://i.ibb.co/example2.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Interstellar",
    "genre": "Adventure, Drama, Sci-Fi",
    "releaseYear": 2014,
    "director": "Christopher Nolan",
    "cast": "Matthew McConaughey, Anne Hathaway",
    "rating": 8.6,
    "duration": 169,
    "plotSummary": "In a future where Earth is slowly becoming uninhabitable due to climate change and dwindling resources, Cooper, a former NASA pilot, is recruited for a critical mission to explore potential new homes for humanity. Alongside a team of scientists, including Dr. Amelia Brand, Cooper travels through a newly discovered wormhole near Saturn, allowing them to reach distant planets that might sustain human life. The journey tests their endurance, resilience, and emotional strength as they encounter uncharted worlds with extreme conditions, time dilation effects, and unforeseen dangers. Cooper is also driven by the desire to ensure a future for his children, particularly his daughter Murph, whose strained relationship with him adds emotional depth to the mission. The team faces ethical dilemmas, life-threatening challenges, and the complexity of space-time physics, questioning the limits of human understanding and sacrifice. As Cooper navigates these cosmic trials, the story explores themes of love, perseverance, and the interconnectedness of human existence. The narrative combines scientific intrigue with emotional resonance, highlighting the struggle for survival, the bonds of family, and the indomitable spirit of exploration in the face of uncertainty and the vastness of the universe.",
    "posterUrl": "https://i.ibb.co/example3.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "The Matrix",
    "genre": "Action, Sci-Fi",
    "releaseYear": 1999,
    "director": "The Wachowskis",
    "cast": "Keanu Reeves, Laurence Fishburne",
    "rating": 8.7,
    "duration": 136,
    "plotSummary": "Neo, a skilled hacker, feels that something is inherently wrong with the world. His suspicions are confirmed when he meets Morpheus, who reveals the shocking truth: reality as humans perceive it is a simulated world known as the Matrix, controlled by sentient machines to enslave humanity. Morpheus believes Neo is 'The One,' a prophesied savior who has the potential to liberate humanity. As Neo trains to harness his abilities within the Matrix, he learns to bend its rules, manipulate its physics, and confront powerful agents who seek to eliminate him. The journey challenges Neo’s understanding of identity, reality, and destiny. Alongside Trinity and the rebels, he navigates a complex web of danger, deception, and philosophical inquiry, questioning the very nature of existence. The story combines breathtaking action sequences, cyberpunk aesthetics, and profound existential themes, exploring the struggle between freedom and control, illusion and truth. Neo must embrace his role as a liberator, balancing human vulnerability with extraordinary power, and ultimately faces choices that will determine the fate of both the real world and the simulated one, redefining what it means to be human and free.",
    "posterUrl": "https://i.ibb.co/example4.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Fight Club",
    "genre": "Drama",
    "releaseYear": 1999,
    "director": "David Fincher",
    "cast": "Brad Pitt, Edward Norton",
    "rating": 8.8,
    "duration": 139,
    "plotSummary": "An insomniac office worker, struggling with feelings of emptiness and disillusionment in a consumer-driven society, forms an unlikely friendship with the charismatic soap salesman Tyler Durden. Together, they create Fight Club, an underground organization where men release their frustrations through bare-knuckle fighting. As the club grows, it evolves into a revolutionary movement known as Project Mayhem, challenging societal norms, corporate control, and the constraints of modern life. The narrator grapples with a growing sense of chaos and loss of control, particularly as he begins to realize the unsettling truths about Tyler Durden and his own fractured psyche. The story delves into themes of identity, masculinity, consumerism, and the struggle to find meaning in a conformist world. Darkly satirical and psychologically complex, Fight Club portrays the tension between individuality and societal expectation, as the protagonist confronts his inner demons and moral dilemmas. Through shocking revelations and escalating conflicts, the narrative examines human nature, the desire for freedom, and the consequences of attempting to break free from the systems that shape our lives.",
    "posterUrl": "https://i.ibb.co/example5.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Pulp Fiction",
    "genre": "Crime, Drama",
    "releaseYear": 1994,
    "director": "Quentin Tarantino",
    "cast": "John Travolta, Uma Thurman",
    "rating": 8.9,
    "duration": 154,
    "plotSummary": "Pulp Fiction interweaves multiple narratives involving crime, redemption, and moral ambiguity in Los Angeles. Hitmen Vincent Vega and Jules Winnfield navigate the dangerous underworld, facing life-threatening situations while engaging in philosophical conversations that highlight their complex characters. The story also follows boxer Butch Coolidge, who must survive betrayal and a rigged fight, and the intersecting lives of mob boss Marsellus Wallace’s wife, Mia, whose evening with Vincent spirals into peril and unexpected outcomes. Through dark humor, violence, and dialogue-driven storytelling, the film explores themes of fate, morality, and consequence. Characters confront dilemmas that force them to question loyalty, justice, and survival, while mundane activities are juxtaposed with shocking violence, emphasizing the unpredictability of life in the criminal underworld. Tarantino’s nonlinear narrative challenges the audience to piece together the sequence of events, deepening engagement and highlighting interconnected human experiences. Ultimately, Pulp Fiction portrays a gritty, morally complex world where choices carry weight, redemption is possible, and every action has ripple effects across the lives of multiple characters.",
    "posterUrl": "https://i.ibb.co/example6.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "The Shawshank Redemption",
    "genre": "Drama",
    "releaseYear": 1994,
    "director": "Frank Darabont",
    "cast": "Tim Robbins, Morgan Freeman",
    "rating": 9.3,
    "duration": 142,
    "plotSummary": "Andy Dufresne, a successful banker, is wrongfully convicted of murdering his wife and her lover and is sentenced to two consecutive life terms at Shawshank State Penitentiary. Inside the prison, Andy faces brutality, corruption, and the harsh realities of prison life. He befriends Ellis 'Red' Redding, a fellow inmate and long-term prisoner, who becomes both a confidant and guide. Andy uses his intelligence and financial skills to gain favor with the prison staff, assisting with money laundering and helping the warden navigate financial challenges. Simultaneously, he enriches the lives of fellow inmates by improving the library, providing education, and fostering a sense of hope and humanity in an oppressive environment. Over the years, Andy secretly plans an intricate escape, demonstrating ingenuity, patience, and perseverance. The story explores themes of friendship, resilience, hope, and the human spirit’s ability to endure injustice. Shawshank Redemption emphasizes that even in the darkest circumstances, determination and hope can lead to freedom, personal redemption, and lasting impact on the lives of others.",
    "posterUrl": "https://i.ibb.co/example7.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Forrest Gump",
    "genre": "Drama, Romance",
    "releaseYear": 1994,
    "director": "Robert Zemeckis",
    "cast": "Tom Hanks, Robin Wright",
    "rating": 8.8,
    "duration": 142,
    "plotSummary": "Forrest Gump, a man with a low IQ but an extraordinary heart, recounts his life story while waiting at a bus stop. Despite his cognitive challenges, Forrest inadvertently influences many historical events in the United States during the mid-20th century. From playing college football to serving heroically in the Vietnam War, and from starting a successful shrimp business to inspiring a generation with his long-distance running, Forrest’s journey is both remarkable and serendipitous. Throughout his adventures, he maintains a deep, unwavering love for his childhood friend Jenny, whose turbulent life contrasts with his steady devotion. Forrest’s innocence, honesty, and perseverance allow him to navigate complex social and political landscapes, while his simple wisdom touches those around him. The story blends historical events with personal experiences, humor with poignancy, and adventure with emotional depth. Forrest Gump illustrates themes of love, destiny, perseverance, and the profound impact one individual can have on the lives of many, reminding audiences that life is unpredictable and extraordinary when approached with courage, kindness, and determination.",
    "posterUrl": "https://i.ibb.co/example8.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "The Godfather",
    "genre": "Crime, Drama",
    "releaseYear": 1972,
    "director": "Francis Ford Coppola",
    "cast": "Marlon Brando, Al Pacino",
    "rating": 9.2,
    "duration": 175,
    "plotSummary": "The Godfather follows the powerful Corleone crime family in post-war New York. Patriarch Vito Corleone maintains influence and control over both the criminal underworld and legitimate business, balancing loyalty, power, and family. When attempts on his life threaten the family’s security, his youngest son Michael, previously uninvolved in family affairs, is drawn into a world of crime and violence. Michael transforms from a reluctant outsider into a strategic, ruthless leader, orchestrating actions to protect and consolidate the family empire. The story explores loyalty, betrayal, honor, and the moral compromises inherent in seeking power. Through political maneuvering, violent confrontations, and complex family dynamics, the film illustrates the tensions between personal morality and the necessities of survival within a criminal enterprise. The Godfather examines the consequences of ambition, the bonds of family, and the corruption of power, presenting a rich, emotionally resonant narrative that has become a benchmark in cinematic storytelling and a profound meditation on crime, loyalty, and the human condition.",
    "posterUrl": "https://i.ibb.co/example9.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "The Lion King",
    "genre": "Animation, Adventure, Drama",
    "releaseYear": 1994,
    "director": "Roger Allers, Rob Minkoff",
    "cast": "Matthew Broderick, Jeremy Irons",
    "rating": 8.5,
    "duration": 88,
    "plotSummary": "In the African savanna, the young lion prince Simba is born to King Mufasa and Queen Sarabi, destined to inherit the Pride Lands. However, the treacherous uncle Scar covets the throne and orchestrates Mufasa’s death, manipulating Simba into believing he is responsible. Consumed by guilt, Simba flees, abandoning his home and family. During exile, he befriends Timon and Pumbaa, who teach him a carefree lifestyle, yet he struggles to reconcile his past and destiny. Eventually, guided by the spirit of his father and the loyal friendships he formed, Simba returns to confront Scar, reclaiming his rightful place as king. The Lion King explores themes of responsibility, courage, redemption, and the cycle of life. Through vivid animation, memorable music, and a compelling narrative, the story emphasizes the importance of family, personal growth, and embracing one’s identity. Simba’s journey portrays the struggle between fear and bravery, loss and renewal, and ultimately celebrates the triumph of good over corruption, showing how resilience, wisdom, and leadership can restore balance to the world.",
    "posterUrl": "https://i.ibb.co/example10.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
   {
    "title": "The Flash",
    "genre": "Action, Adventure, Sci-Fi",
    "releaseYear": 2023,
    "director": "Andy Muschietti",
    "cast": "Ezra Miller, Michael Keaton",
    "rating": 6.2,
    "duration": 144,
    "plotSummary": "Barry Allen, a young forensic scientist with extraordinary speed, discovers that he has the ability to move at superhuman velocities. Driven by a desire to correct past tragedies, particularly the death of his mother, Barry tests the limits of his powers and attempts to alter the timeline, inadvertently creating unforeseen consequences. As he navigates alternate realities, Barry encounters multiple versions of familiar heroes and villains, each with their own motives and perspectives. The story explores themes of causality, responsibility, and the ethical implications of changing the past. Barry must confront the consequences of his actions as they ripple across time and space, leading to unpredictable chaos. His journey is not only a physical battle against formidable adversaries but also a personal exploration of grief, regret, and heroism. Alongside allies who help him navigate the multiverse, Barry struggles to restore balance and prevent catastrophic alterations to reality. The narrative combines high-octane action, emotional resonance, and complex sci-fi concepts, challenging Barry to reconcile his desire for personal redemption with the greater responsibility he bears to protect the timeline and preserve the fabric of reality itself.",
    "posterUrl": "https://i.ibb.co/theflash.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Ant-Man and the Wasp: Quantumania",
    "genre": "Action, Adventure, Comedy",
    "releaseYear": 2023,
    "director": "Peyton Reed",
    "cast": "Paul Rudd, Evangeline Lilly",
    "rating": 6.1,
    "duration": 124,
    "plotSummary": "Scott Lang and Hope van Dyne, the heroic duo known as Ant-Man and the Wasp, embark on a daring adventure into the mysterious Quantum Realm. This microscopic universe, with its bizarre landscapes, unpredictable physics, and time-distorted regions, presents both wonder and danger. The pair faces new threats, including a formidable villain who seeks to exploit the Quantum Realm for personal gain, potentially endangering reality itself. Along the journey, Scott confronts the complexities of heroism, family, and the moral responsibility that comes with extraordinary powers. The narrative explores themes of courage, teamwork, and the consequences of manipulating forces beyond human comprehension. The characters navigate intricate tunnels, interact with strange and enigmatic inhabitants, and confront challenges that test their intelligence, resourcefulness, and emotional resilience. Humor, heart, and action are interwoven throughout, balancing the fantastical elements with personal stakes. Scott and Hope must rely on their wits, ingenuity, and unwavering bond to overcome perilous obstacles, prevent catastrophe, and safeguard both the Quantum Realm and the world they know, highlighting the fusion of science fiction spectacle with intimate human storytelling.",
    "posterUrl": "https://i.ibb.co/antman.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Guardians of the Galaxy Vol. 3",
    "genre": "Action, Adventure, Comedy",
    "releaseYear": 2023,
    "director": "James Gunn",
    "cast": "Chris Pratt, Zoe Saldana",
    "rating": 8.1,
    "duration": 150,
    "plotSummary": "The Guardians of the Galaxy, a misfit band of intergalactic heroes, embark on a mission filled with cosmic stakes, personal challenges, and the occasional humorous misadventure. Faced with a new, powerful threat that endangers one of their own, the team must navigate treacherous planets, encounter alien civilizations, and reconcile past mistakes while leveraging their unique abilities. Peter Quill, Gamora, Rocket, Drax, and Groot confront their personal demons and interpersonal conflicts, testing the strength of their friendships and loyalty. The narrative delves into themes of family, redemption, sacrifice, and the meaning of heroism in a vast and unpredictable universe. High-energy action sequences, inventive technology, and clever strategies combine with humor, emotional moments, and character growth. Each Guardian faces critical decisions, balancing self-interest with the greater good. The story examines the nature of belonging, the consequences of past choices, and the resilience required to overcome overwhelming odds. As the team unites to confront cosmic adversaries, they learn that true strength lies not only in powers or weaponry but also in trust, collaboration, and the unwavering bonds they share as a chosen family protecting the galaxy.",
    "posterUrl": "https://i.ibb.co/guardians3.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Oppenheimer",
    "genre": "Biography, Drama, History",
    "releaseYear": 2023,
    "director": "Christopher Nolan",
    "cast": "Cillian Murphy, Emily Blunt",
    "rating": 8.5,
    "duration": 180,
    "plotSummary": "Oppenheimer chronicles the life and work of J. Robert Oppenheimer, a brilliant physicist whose intellect and ambition lead him to spearhead the Manhattan Project, the top-secret World War II endeavor to develop the atomic bomb. The film explores Oppenheimer’s scientific achievements, ethical dilemmas, and personal struggles as he navigates political pressures, wartime urgency, and moral considerations surrounding the creation of a weapon capable of unprecedented destruction. As Oppenheimer assembles a team of exceptional scientists, he must balance scientific innovation with secrecy and national security concerns. Relationships with colleagues, government officials, and family add complexity to his journey, highlighting both triumphs and personal sacrifices. The narrative delves into the psychological impact of developing a weapon of mass destruction, exploring guilt, responsibility, and the far-reaching consequences of scientific advancement. Through historical context, character-driven storytelling, and intense emotional exploration, the film examines the tension between human ambition and ethical responsibility. Oppenheimer’s story ultimately reflects the profound challenges faced by individuals whose contributions change the course of history, emphasizing the weight of human ingenuity, moral accountability, and the enduring consequences of choices made in extraordinary circumstances.",
    "posterUrl": "https://i.ibb.co/oppenheimer.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "John Wick: Chapter 4",
    "genre": "Action, Thriller",
    "releaseYear": 2023,
    "director": "Chad Stahelski",
    "cast": "Keanu Reeves, Donnie Yen",
    "rating": 8.0,
    "duration": 169,
    "plotSummary": "John Wick, a legendary former hitman, continues his relentless quest to survive and confront the powerful criminal organization known as the High Table. Pursued by assassins and enemies seeking retribution, John must navigate a labyrinthine underworld filled with dangerous adversaries, intricate codes of conduct, and deadly confrontations. The narrative explores themes of vengeance, loyalty, and the consequences of a life steeped in violence. John’s relationships, both past and present, complicate his mission as he faces moral dilemmas and the toll of relentless combat. Each encounter is strategically choreographed, blending intense action, precision combat, and cinematic spectacle. As he uncovers hidden truths and confronts formidable opponents, John demonstrates resilience, ingenuity, and tactical mastery, emphasizing the human drive for survival and justice. The film delves into the emotional and psychological aspects of an individual living under constant threat, exploring the burden of choices made and the unyielding pursuit of personal goals. John Wick’s journey combines high-stakes action with character-driven narrative, highlighting courage, perseverance, and the struggle to maintain agency within a ruthless world.",
    "posterUrl": "https://i.ibb.co/johnwick4.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Barbie",
    "genre": "Adventure, Comedy, Fantasy",
    "releaseYear": 2023,
    "director": "Greta Gerwig",
    "cast": "Margot Robbie, Ryan Gosling",
    "rating": 7.0,
    "duration": 114,
    "plotSummary": "Barbie, a glamorous and iconic figure from Barbie Land, embarks on a whimsical and transformative adventure into the real world. Leaving behind the perfection and predictability of her animated home, she encounters unfamiliar challenges, discovers cultural nuances, and navigates complex human relationships. Along the journey, Barbie learns about identity, self-acceptance, and the contrast between fantasy and reality. Encounters with diverse characters, humorous situations, and unexpected obstacles test her creativity, resilience, and adaptability. The story blends comedy, fantasy, and heartfelt moments to explore themes of empowerment, personal growth, and the importance of authenticity. Barbie’s adventure challenges traditional notions of perfection and highlights the value of embracing individuality, diversity, and human imperfection. As she reconciles her idealized self with the realities of the world, Barbie discovers that true fulfillment lies in meaningful connections, courage, and self-awareness. The narrative combines colorful visuals, witty dialogue, and engaging scenarios to create an entertaining yet thought-provoking exploration of transformation, friendship, and the search for purpose.",
    "posterUrl": "https://i.ibb.co/barbie.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Mission: Impossible – Dead Reckoning Part One",
    "genre": "Action, Adventure, Thriller",
    "releaseYear": 2023,
    "director": "Christopher McQuarrie",
    "cast": "Tom Cruise, Rebecca Ferguson",
    "rating": 7.6,
    "duration": 163,
    "plotSummary": "Ethan Hunt, a skilled operative of the Impossible Mission Force, faces a global threat that requires the utmost precision, bravery, and ingenuity. Tasked with preventing catastrophic events orchestrated by a mysterious adversary, Hunt assembles a team of trusted allies to undertake perilous missions across the globe. The narrative is filled with high-stakes espionage, elaborate schemes, and daring stunts that push the boundaries of human capability. Hunt’s pursuit of justice challenges him physically, mentally, and emotionally, as he navigates deception, betrayal, and the fine line between duty and personal morality. Relationships with his team, friends, and adversaries are tested under extreme conditions, emphasizing themes of loyalty, trust, and the consequences of choices made in life-or-death scenarios. Each obstacle requires creativity, adaptability, and strategic planning, showcasing the intricate choreography of modern espionage. The film blends suspense, action, and narrative complexity, exploring courage, resilience, and the relentless drive of a hero determined to protect the world from imminent danger while balancing personal sacrifices and moral responsibility.",
    "posterUrl": "https://i.ibb.co/missionimpossible7.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Transformers: Rise of the Beasts",
    "genre": "Action, Adventure, Sci-Fi",
    "releaseYear": 2023,
    "director": "Steven Caple Jr.",
    "cast": "Anthony Ramos, Dominique Fishback",
    "rating": 6.8,
    "duration": 127,
    "plotSummary": "Humans and Autobots must confront a new threat from the Maximals and Predacons, ancient and powerful Transformers whose arrival disrupts the balance of the world. The story follows human allies who become entangled in this intergalactic conflict, learning to navigate alliances, danger, and the responsibilities that come with extraordinary knowledge. The Autobots, led by Optimus Prime, must unite against adversaries that challenge not only their strength but their ethical principles and sense of duty. Characters encounter spectacular landscapes, advanced technology, and life-or-death situations that test courage, ingenuity, and teamwork. Themes of loyalty, trust, and heroism are explored as the battle escalates, highlighting the stakes of preserving peace and protecting humanity. Through high-octane action sequences, emotional character arcs, and the clash of advanced civilizations, the narrative underscores the power of collaboration, strategic thinking, and resilience when facing overwhelming odds. The story combines science fiction spectacle with human emotion, creating a compelling adventure where courage and morality are tested amidst extraordinary circumstances.",
    "posterUrl": "https://i.ibb.co/transformers.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "The Marvels",
    "genre": "Action, Adventure, Sci-Fi",
    "releaseYear": 2023,
    "director": "Nia DaCosta",
    "cast": "Brie Larson, Iman Vellani",
    "rating": 7.1,
    "duration": 105,
    "plotSummary": "Carol Danvers, Kamala Khan, and Monica Rambeau join forces to confront a cosmic threat that endangers Earth and the wider universe. Each hero brings unique abilities, experiences, and perspectives, creating challenges in collaboration and communication. The narrative explores themes of empowerment, teamwork, responsibility, and identity, emphasizing how individual strengths can combine to overcome overwhelming adversity. As they navigate interstellar landscapes, face alien adversaries, and confront personal struggles, the heroes learn to trust one another and coordinate their abilities strategically. The story balances high-stakes action, cosmic spectacle, and emotional resonance, highlighting the ethical dilemmas of wielding immense power and the importance of moral integrity. Each encounter challenges their resilience, ingenuity, and sense of duty, reinforcing the notion that true heroism lies not only in power but in courage, empathy, and the ability to protect others despite personal risk. The Marvels blends thrilling adventure with character-driven storytelling, emphasizing unity, perseverance, and the interconnectedness of heroes across the universe.",
    "posterUrl": "https://i.ibb.co/themarvels.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Wonka",
    "genre": "Adventure, Comedy, Family",
    "releaseYear": 2023,
    "director": "Paul King",
    "cast": "Timothée Chalamet, Olivia Colman",
    "rating": 7.5,
    "duration": 115,
    "plotSummary": "A young Willy Wonka embarks on a magical journey to establish his legendary chocolate factory. The story explores Wonka’s origins, showcasing his inventive genius, curious nature, and imaginative mind. Along the way, he encounters fantastical characters, whimsical landscapes, and extraordinary challenges that test creativity, courage, and determination. Themes of ambition, self-discovery, and resilience are central as Wonka navigates the balance between innovation and human connection. He must confront obstacles that reveal both the sweetness and consequences of ambition, learning lessons about responsibility, friendship, and the power of wonder. The narrative blends humor, adventure, and fantasy, creating a vibrant and immersive world that captivates audiences of all ages. Wonka’s journey emphasizes the importance of embracing imagination, ethical choices, and the joy of creativity, ultimately highlighting the transformative power of dreams, curiosity, and the human spirit in shaping extraordinary achievements and bringing delight to the world.",
    "posterUrl": "https://i.ibb.co/wonka.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
   {
    "title": "Spider-Man: No Way Home",
    "genre": "Action, Adventure, Sci-Fi",
    "releaseYear": 2021,
    "director": "Jon Watts",
    "cast": "Tom Holland, Zendaya",
    "rating": 8.4,
    "duration": 148,
    "plotSummary": "Peter Parker, having his secret identity revealed to the world, struggles with the overwhelming consequences of fame, scrutiny, and threats to those he loves. Seeking to restore normalcy, he turns to Doctor Strange for help, requesting a spell to make the world forget he is Spider-Man. However, the spell goes awry, breaking the boundaries between universes and causing villains from alternate realities to enter Peter’s world. Faced with iconic adversaries from previous Spider-Man timelines, Peter is pushed to his limits, forced to confront challenges that test his ingenuity, courage, and moral compass. Throughout his journey, he grapples with the heavy responsibility of power, the consequences of choices, and the essence of true heroism. With the support of allies, including MJ and Ned, Peter navigates high-stakes battles, emotional turmoil, and ethical dilemmas. The narrative intertwines thrilling action sequences with deeply personal moments, exploring themes of sacrifice, identity, and growth. Ultimately, Peter must make decisions that define not only his fate but also the safety of his universe, learning that heroism often demands selflessness, resilience, and the willingness to confront impossible odds.",
    "posterUrl": "https://i.ibb.co/spiderman.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "The Batman",
    "genre": "Action, Crime, Drama",
    "releaseYear": 2022,
    "director": "Matt Reeves",
    "cast": "Robert Pattinson, Zoë Kravitz",
    "rating": 8.2,
    "duration": 176,
    "plotSummary": "Batman ventures deep into Gotham City's underworld to uncover corruption and confront the serial killer known as the Riddler, whose cryptic crimes reveal the darkest secrets of the city. As Bruce Wayne investigates, he discovers layers of deception, political intrigue, and systemic failures that perpetuate crime and injustice. The narrative explores his dual identity, examining the psychological weight of trauma, guilt, and the relentless pursuit of justice. Batman’s detective skills are challenged by complex puzzles, dangerous adversaries, and moral dilemmas that test the limits of his resolve. Relationships with allies, including Catwoman, Commissioner Gordon, and Alfred, are strained and strengthened as he navigates the shadows of Gotham, balancing vengeance with the responsibility of safeguarding the innocent. Themes of morality, vigilantism, accountability, and redemption are central, highlighting the internal and external battles that define the Dark Knight. The story combines noir-style storytelling, intense action, and character-driven drama, portraying Batman as both a hero and a man wrestling with the consequences of his mission, emphasizing courage, resilience, and the enduring fight against corruption and evil.",
    "posterUrl": "https://i.ibb.co/batman.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Avatar 2: The Way of Water",
    "genre": "Action, Adventure, Sci-Fi",
    "releaseYear": 2022,
    "director": "James Cameron",
    "cast": "Sam Worthington, Zoe Saldaña",
    "rating": 7.8,
    "duration": 192,
    "plotSummary": "Jake Sully and Neytiri struggle to protect their family and homeland from renewed human threats that aim to exploit Pandora's resources. As their children grow, the family must adapt to new challenges, including environmental hazards, interspecies conflicts, and the moral complexities of defending their way of life. The story delves into themes of family, loyalty, ecological responsibility, and the consequences of colonization. The Na’vi navigate underwater realms, encounter unique creatures, and uncover ancient secrets that test their courage, ingenuity, and resilience. Jake and Neytiri confront personal fears and ethical dilemmas as they attempt to safeguard their loved ones while balancing the preservation of their culture and environment. The narrative blends breathtaking visual spectacle with emotional depth, exploring identity, leadership, and the interconnectedness of life on Pandora. Conflicts intensify as human invaders employ advanced technology, forcing the Na’vi to innovate, strategize, and rely on trust and unity. Through perilous journeys, epic battles, and poignant moments, the film emphasizes the importance of harmony with nature, the strength of familial bonds, and the enduring fight to protect what is sacred against overwhelming odds.",
    "posterUrl": "https://i.ibb.co/avatar2-2.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Thor: Love and Thunder",
    "genre": "Action, Adventure, Comedy",
    "releaseYear": 2022,
    "director": "Taika Waititi",
    "cast": "Chris Hemsworth, Natalie Portman",
    "rating": 6.9,
    "duration": 119,
    "plotSummary": "Thor embarks on a journey unlike any he has faced before, seeking inner peace while confronting old allies and new threats across the cosmos. The God of Thunder must reconcile his past failures, fractured relationships, and personal insecurities with the responsibilities of heroism. When a powerful new adversary emerges, Thor is forced to reunite with old friends and confront challenges that test his strength, courage, and moral judgment. The narrative explores themes of identity, self-discovery, love, and resilience, blending humor, epic battles, and heartfelt moments. Alongside Jane Foster, who now wields the mighty Mjolnir, Thor navigates cosmic realms, uncovers hidden truths, and confronts the complexities of power and leadership. The film balances action-packed sequences with emotional depth, examining how heroism is intertwined with vulnerability, sacrifice, and personal growth. Through battles, alliances, and introspection, Thor learns that true strength lies not only in physical power but in emotional intelligence, compassion, and the willingness to face the unknown with courage and integrity.",
    "posterUrl": "https://i.ibb.co/thor.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Doctor Strange in the Multiverse of Madness",
    "genre": "Action, Adventure, Fantasy",
    "releaseYear": 2022,
    "director": "Sam Raimi",
    "cast": "Benedict Cumberbatch, Elizabeth Olsen",
    "rating": 7.0,
    "duration": 126,
    "plotSummary": "Doctor Strange must confront threats across the multiverse that defy logic, reality, and his own understanding of magic. After a spell intended to help a friend goes awry, Strange faces consequences that tear through multiple dimensions, unleashing dangerous beings and destabilizing entire realities. He allies with Wanda Maximoff, the Scarlet Witch, to navigate a fractured multiverse, encountering alternate versions of familiar characters and facing moral dilemmas that challenge his ethics and mastery of the mystic arts. The narrative explores themes of responsibility, sacrifice, power, and the complexities of choice, emphasizing how even the smallest action can have far-reaching consequences across infinite worlds. As Strange journeys through strange realms, confronts twisted versions of reality, and battles formidable enemies, he must reconcile personal desires with the greater good. The story blends suspense, horror, action, and profound emotional arcs, portraying the psychological and ethical weight of manipulating the multiverse. Ultimately, Doctor Strange learns that true heroism demands humility, courage, and the wisdom to balance personal ambition with the preservation of countless lives and realities.",
    "posterUrl": "https://i.ibb.co/doctorstrange2.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Black Adam",
    "genre": "Action, Adventure, Fantasy",
    "releaseYear": 2022,
    "director": "Jaume Collet-Serra",
    "cast": "Dwayne Johnson, Pierce Brosnan",
    "rating": 6.5,
    "duration": 125,
    "plotSummary": "Black Adam, an ancient antihero empowered by mystical forces, emerges in the modern world after centuries of imprisonment. His arrival triggers chaos, as he seeks vengeance against those who wronged him and challenges the established order of heroes and rulers. The story explores the moral ambiguity of power, justice, and retribution, highlighting the fine line between heroism and tyranny. As Black Adam confronts the Justice Society of America and other powerful figures, conflicts arise that test his abilities, strategy, and personal convictions. Themes of legacy, responsibility, and the consequences of unchecked strength are central, reflecting both internal struggles and external battles. The narrative combines epic action, supernatural abilities, and intense confrontations with moral and ethical dilemmas, creating a layered depiction of a character wrestling with vengeance, purpose, and the complexities of heroism. Through dynamic battles, personal introspection, and interactions with allies and adversaries, Black Adam’s journey illuminates the challenges of balancing power, justice, and humanity in a world where the line between good and evil is constantly blurred.",
    "posterUrl": "https://i.ibb.co/blackadam.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Everything Everywhere All at Once",
    "genre": "Action, Adventure, Comedy",
    "releaseYear": 2022,
    "director": "Daniel Kwan, Daniel Scheinert",
    "cast": "Michelle Yeoh, Ke Huy Quan",
    "rating": 8.0,
    "duration": 139,
    "plotSummary": "An ordinary woman, Evelyn, unexpectedly discovers that she is connected to infinite versions of herself across countless universes. She is thrust into a chaotic adventure, forced to navigate these parallel realities and confront a mysterious force threatening existence itself. As Evelyn explores different lives she could have led, she gains unique skills, insights, and emotional resilience, realizing the impact of her choices and relationships. The narrative weaves comedy, action, philosophy, and heartfelt drama, exploring themes of identity, meaning, family, and the interconnectedness of existence. Evelyn must reconcile personal desires, regrets, and fears while making critical decisions that influence multiple realities. Alongside her husband and daughter, she faces moral dilemmas, battles surreal adversaries, and discovers profound truths about love, purpose, and human potential. The film blends inventive storytelling, absurdist humor, and emotional depth to create a visually and narratively complex journey, emphasizing courage, self-discovery, and the power of embracing one’s multiple selves to affect change in both personal and cosmic scales.",
    "posterUrl": "https://i.ibb.co/everything.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "No Time to Die",
    "genre": "Action, Adventure, Thriller",
    "releaseYear": 2021,
    "director": "Cary Joji Fukunaga",
    "cast": "Daniel Craig, Rami Malek",
    "rating": 7.3,
    "duration": 163,
    "plotSummary": "James Bond, having left active service, is drawn back into action when a new global threat emerges, endangering millions of lives. He faces Lyutsifer Safin, a formidable antagonist wielding advanced technology and personal vendettas, requiring Bond to confront both physical and psychological challenges. The narrative explores themes of loyalty, duty, personal sacrifice, and the toll of a life dedicated to espionage. Bond must navigate complex alliances, deceit, and betrayal while protecting those he loves and neutralizing imminent dangers. High-octane action sequences, intricate planning, and tense confrontations define his journey, reflecting the physical and emotional demands of espionage. The story also delves into Bond’s vulnerabilities, humanizing the legendary agent as he faces moral dilemmas and reconciles his past with present responsibilities. Ultimately, Bond’s courage, resourcefulness, and determination are tested as he battles formidable adversaries, balances duty with personal stakes, and confronts the consequences of a life lived on the edge, underscoring themes of heroism, resilience, and the enduring impact of individual choices on global events.",
    "posterUrl": "https://i.ibb.co/notimetodie.jpg",
    "language": "English",
    "country": "UK",
    "addedBy": "user@example.com"
  },
  {
    "title": "Dune",
    "genre": "Adventure, Drama, Sci-Fi",
    "releaseYear": 2021,
    "director": "Denis Villeneuve",
    "cast": "Timothée Chalamet, Zendaya",
    "rating": 8.1,
    "duration": 155,
    "plotSummary": "Paul Atreides, a gifted young noble, is thrust into a perilous world when his family takes control of the desert planet Arrakis, the only source of the universe's most valuable substance, the spice melange. The narrative explores themes of destiny, power, politics, and environmental stewardship, as Paul grapples with personal growth, leadership responsibilities, and cultural tensions with the native Fremen. Facing assassination attempts, betrayal, and interstellar warfare, Paul must harness both his intellect and emerging mystical abilities to navigate political intrigue and survive in a harsh environment. The story delves into the complexities of loyalty, honor, and the burden of prophecy, while highlighting the clash between colonial ambitions and indigenous resistance. Through epic battles, strategic alliances, and moral dilemmas, Paul learns to balance ambition with compassion, shaping the fate of Arrakis and influencing the universe at large. The film combines grandiose visuals, intricate storytelling, and philosophical depth, examining human ambition, identity, and the consequences of power when interwoven with destiny and survival.",
    "posterUrl": "https://i.ibb.co/dune.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Top Gun: Maverick",
    "genre": "Action, Drama",
    "releaseYear": 2022,
    "director": "Joseph Kosinski",
    "cast": "Tom Cruise, Miles Teller",
    "rating": 8.4,
    "duration": 131,
    "plotSummary": "Captain Pete 'Maverick' Mitchell, now a seasoned Navy pilot, is tasked with training a new generation of elite fighter pilots for a high-stakes mission that tests skill, courage, and leadership. As Maverick navigates the challenges of mentorship, he must reconcile with his past, including unresolved conflicts and the legacy of his friendships and losses. The narrative explores themes of courage, responsibility, personal growth, and the evolving nature of heroism. Maverick faces intense aerial combat simulations, real-world dangers, and emotional pressures that test his abilities and decision-making. Relationships with protégés, colleagues, and former allies highlight the human dimension of military service, blending action, suspense, and drama. Through daring maneuvers, strategic thinking, and personal reflection, Maverick exemplifies resilience, innovation, and the willingness to confront fear and adversity. The film balances thrilling aerial sequences with character-driven storytelling, emphasizing mentorship, teamwork, and the enduring pursuit of excellence, honoring the spirit of courage, dedication, and sacrifice inherent in the life of a Navy pilot.",
    "posterUrl": "https://i.ibb.co/topgun.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
   {
    "title": "Avatar",
    "genre": "Action, Adventure, Sci-Fi",
    "releaseYear": 2009,
    "director": "James Cameron",
    "cast": "Sam Worthington, Zoe Saldana",
    "rating": 7.8,
    "duration": 162,
    "plotSummary": "Jake Sully, a paraplegic Marine, is sent to the alien world of Pandora to participate in the Avatar Program, which allows him to control a genetically engineered Na’vi body. Immersed in the lush, vibrant ecosystem, he begins to understand the customs, beliefs, and way of life of the indigenous Na’vi people. Tasked with gathering intelligence for the human corporate interests intent on mining Pandora's valuable resources, Jake faces a moral conflict as he grows emotionally attached to the Na’vi and their land. His loyalty shifts from his human commanders to the people he learns to respect and love. He becomes deeply involved with Neytiri, a Na’vi warrior, learning the spiritual and ecological wisdom of Pandora. As tensions escalate between the humans and the Na’vi, Jake must lead a resistance to protect the planet from destruction. The story explores themes of identity, colonialism, environmentalism, love, and the interconnectedness of all life, highlighting personal transformation, courage, and the struggle to balance duty with conscience. The film combines stunning visuals, thrilling action, and a powerful emotional core.",
    "posterUrl": "https://i.ibb.co/avatar.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Gladiator",
    "genre": "Action, Adventure, Drama",
    "releaseYear": 2000,
    "director": "Ridley Scott",
    "cast": "Russell Crowe, Joaquin Phoenix",
    "rating": 8.5,
    "duration": 155,
    "plotSummary": "Maximus Decimus Meridius, a loyal Roman general, is betrayed by Commodus, the ambitious son of Emperor Marcus Aurelius, who murders his father to seize power. Stripped of rank, enslaved, and separated from his family, Maximus is forced to fight as a gladiator in brutal arenas across the Roman Empire. Driven by a desire for vengeance and justice, he rises through the ranks, earning the admiration of the masses while secretly plotting to confront Commodus. The narrative explores themes of loyalty, honor, revenge, and the corrupting influence of power. Maximus must navigate political intrigue, deadly combat, and personal loss while maintaining his integrity and purpose. Relationships with fellow gladiators, loyal allies, and the people of Rome highlight the human dimension of his journey. Through epic battles, strategic cunning, and moral fortitude, Maximus becomes a symbol of resistance and courage, inspiring both the oppressed and the powerful. The story balances action, political drama, and emotional depth, examining the cost of ambition, the power of legacy, and the enduring pursuit of justice and redemption against overwhelming odds.",
    "posterUrl": "https://i.ibb.co/gladiator.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Jurassic Park",
    "genre": "Action, Adventure, Sci-Fi",
    "releaseYear": 1993,
    "director": "Steven Spielberg",
    "cast": "Sam Neill, Laura Dern, Jeff Goldblum",
    "rating": 8.1,
    "duration": 127,
    "plotSummary": "When a billionaire philanthropist creates a theme park populated with genetically cloned dinosaurs, scientists and guests are invited to witness this groundbreaking experiment. Dr. Alan Grant, Dr. Ellie Sattler, and mathematician Ian Malcolm are among the experts who arrive to assess the safety and feasibility of the park. However, the park's security systems fail catastrophically, causing the dinosaurs to escape containment. The group is thrust into a life-or-death struggle against some of the planet's most dangerous prehistoric creatures. Amidst suspense, chaos, and awe-inspiring encounters, the narrative explores themes of human hubris, the ethical consequences of scientific advancement, and the unpredictable power of nature. Characters must rely on intelligence, courage, and cooperation to survive. The story combines thrilling action sequences, scientific intrigue, and moments of wonder, as humans confront creatures that were thought to exist only in history. The film emphasizes respect for nature, the limits of human control, and the unforeseen consequences of tampering with life, blending adventure, horror, and philosophical reflection into a cinematic masterpiece.",
    "posterUrl": "https://i.ibb.co/jurassic.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Titanic",
    "genre": "Drama, Romance",
    "releaseYear": 1997,
    "director": "James Cameron",
    "cast": "Leonardo DiCaprio, Kate Winslet",
    "rating": 7.8,
    "duration": 195,
    "plotSummary": "Aboard the ill-fated RMS Titanic, Jack Dawson, a poor artist, and Rose DeWitt Bukater, a wealthy young woman engaged to a controlling fiancé, form a deep and passionate connection despite societal boundaries. Their romance unfolds against the backdrop of luxury, opulence, and impending disaster. As they navigate class divisions, familial pressures, and personal growth, the lovers experience profound joy, freedom, and emotional awakening. The narrative interweaves suspense and tragedy as the Titanic strikes an iceberg, initiating a catastrophic sinking. The passengers face chaos, fear, and life-or-death decisions, revealing heroism, cowardice, and humanity's resilience. Jack and Rose confront moral dilemmas, personal sacrifice, and the fragility of life, deepening their emotional bond. The story explores love, fate, mortality, and the stark contrasts between privilege and adversity, emphasizing the enduring impact of choices, courage, and connection in the face of disaster. Through stunning visual effects, period detail, and deeply human storytelling, the film captures the grandeur of the Titanic, the intensity of forbidden love, and the profound tragedy of one of history's most infamous maritime disasters.",
    "posterUrl": "https://i.ibb.co/titanic.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "The Avengers",
    "genre": "Action, Adventure, Sci-Fi",
    "releaseYear": 2012,
    "director": "Joss Whedon",
    "cast": "Robert Downey Jr., Chris Evans, Scarlett Johansson",
    "rating": 8.0,
    "duration": 143,
    "plotSummary": "When the powerful alien warlord Loki threatens Earth with his army and the Tesseract's cosmic power, Nick Fury and S.H.I.E.L.D. assemble the world's greatest heroes to stop him. Iron Man, Captain America, Thor, Hulk, Black Widow, and Hawkeye must overcome personal differences, egos, and distrust to form a cohesive team. Facing immense danger and global stakes, the Avengers battle Loki and his forces, learning the importance of collaboration, strategy, and sacrifice. The narrative explores themes of leadership, responsibility, heroism, and the challenges of working together despite differing motivations and worldviews. Relationships are tested as individual heroes confront fears, past traumas, and ethical dilemmas, forging bonds that strengthen their unity. Through epic battles, innovative teamwork, and personal growth, the Avengers emerge as a symbol of hope and resilience, demonstrating that collective effort and courage can overcome seemingly insurmountable threats. The film balances action, humor, and emotional resonance, emphasizing the human dimension of superhuman heroes and the power of unity in defending the world against extraordinary dangers.",
    "posterUrl": "https://i.ibb.co/avengers.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Avatar: The Way of Water",
    "genre": "Action, Adventure, Sci-Fi",
    "releaseYear": 2022,
    "director": "James Cameron",
    "cast": "Sam Worthington, Zoe Saldaña",
    "rating": 7.7,
    "duration": 192,
    "plotSummary": "Years after the events of the first Avatar, Jake Sully and Neytiri have formed a family and strive to maintain harmony with Pandora’s environment while protecting their children from human exploitation. New threats emerge, forcing the Na’vi to venture into uncharted aquatic territories and interact with the oceanic clans of Pandora. The story delves into themes of environmental stewardship, intergenerational responsibility, and cultural identity. As the family navigates both natural dangers and human invaders, they confront ethical dilemmas about loyalty, protection, and coexistence. Relationships are tested through conflict, loss, and adaptation, highlighting resilience, courage, and the power of unity. The narrative combines thrilling action, breathtaking visuals, and deep emotional arcs, emphasizing the connection between the Na’vi and the world around them. Through exploration, battle, and self-discovery, the characters learn to balance family bonds with the greater duty to safeguard their planet, reinforcing themes of sacrifice, courage, and the enduring fight to protect life in all its forms.",
    "posterUrl": "https://i.ibb.co/avatar2.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Black Panther",
    "genre": "Action, Adventure, Sci-Fi",
    "releaseYear": 2018,
    "director": "Ryan Coogler",
    "cast": "Chadwick Boseman, Michael B. Jordan",
    "rating": 7.3,
    "duration": 134,
    "plotSummary": "T'Challa, newly crowned King of Wakanda, must balance his responsibilities as monarch with his role as the Black Panther. When a powerful adversary from outside challenges his leadership and threatens Wakanda’s secrecy and safety, T'Challa confronts personal doubts, national duty, and global consequences. The narrative explores themes of identity, heritage, leadership, responsibility, and the tension between isolationism and global involvement. T’Challa faces moral dilemmas about power, justice, and the ethical use of advanced technology that could shift the balance of power worldwide. Allies and adversaries alike challenge his vision, forcing him to evolve as a leader and hero. Through intense action sequences, political intrigue, and deeply human interactions, T'Challa learns the importance of collaboration, understanding, and courage. The story emphasizes the significance of legacy, cultural pride, and using power for the greater good, blending superhero spectacle with nuanced social commentary and emotional depth, making it both thrilling and thought-provoking.",
    "posterUrl": "https://i.ibb.co/blackpanther.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Doctor Strange",
    "genre": "Action, Adventure, Fantasy",
    "releaseYear": 2016,
    "director": "Scott Derrickson",
    "cast": "Benedict Cumberbatch, Chiwetel Ejiofor",
    "rating": 7.5,
    "duration": 115,
    "plotSummary": "Dr. Stephen Strange, a brilliant but arrogant neurosurgeon, suffers a career-ending car accident that damages his hands. Desperate to heal and regain his abilities, he embarks on a journey of physical and spiritual recovery, leading him to the mystic arts and Kamar-Taj. Under the tutelage of the Ancient One, Strange learns to harness magic, manipulate time, and perceive dimensions beyond ordinary reality. He confronts dark forces, including the manipulative Kaecilius, who threatens Earth with eternal chaos. The narrative explores themes of humility, transformation, responsibility, and the balance of power. Strange must reconcile his previous ego with his new role as a protector of reality, learning that true strength lies not in personal skill alone but in wisdom, compassion, and sacrifice. Through thrilling battles, mind-bending magical sequences, and moral dilemmas, Doctor Strange evolves into a hero who must navigate complex dimensions and ethical challenges. The story blends action, fantasy, and philosophical depth, highlighting the journey from self-centered ambition to selfless heroism, illustrating the profound impact of choice, knowledge, and courage.",
    "posterUrl": "https://i.ibb.co/doctorstrange.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Guardians of the Galaxy",
    "genre": "Action, Adventure, Comedy",
    "releaseYear": 2014,
    "director": "James Gunn",
    "cast": "Chris Pratt, Zoe Saldana",
    "rating": 8.0,
    "duration": 121,
    "plotSummary": "A group of intergalactic criminals, led by Peter Quill, must unite to stop the fanatic Ronan from obtaining a powerful orb capable of mass destruction. Each member of the group—Gamora, Drax, Rocket, and Groot—carries a personal burden and a criminal past, which initially creates tension and distrust. Through shared danger, epic battles, and humorous misadventures, they gradually form a cohesive team, learning to rely on each other and finding redemption through their actions. The narrative explores themes of family, friendship, sacrifice, and personal transformation, emphasizing that bonds formed by choice can be as strong as those of blood. As they navigate the cosmic landscape, confront deadly adversaries, and make critical decisions, the Guardians evolve from outlaws into heroes, protecting the universe from a devastating threat. The story combines humor, action, emotion, and visual spectacle, creating a vibrant, character-driven adventure that celebrates teamwork, courage, and the possibility of redemption for even the most flawed individuals.",
    "posterUrl": "https://i.ibb.co/guardians.jpg",
    "language": "English",
    "country": "USA",
    "addedBy": "user@example.com"
  },
  {
    "title": "Doctor Who: The Movie",
    "genre": "Adventure, Drama, Sci-Fi",
    "releaseYear": 1996,
    "director": "Geoffrey Sax",
    "cast": "Paul McGann, Daphne Ashbrook",
    "rating": 6.2,
    "duration": 90,
    "plotSummary": "The Doctor regenerates into a new form and discovers a renewed threat from the Master, his arch-nemesis, who plans to manipulate time and dominate Earth. The Doctor, along with companion Grace Holloway, must navigate temporal anomalies, decode complex mysteries, and prevent catastrophic consequences. The narrative explores themes of identity, responsibility, moral choice, and the consequences of tampering with time. As the Doctor confronts his past and faces the dangers of his regenerating nature, he grapples with the burden of being the universe’s protector. The film combines science fiction adventure, suspense, and personal drama, highlighting the Doctor’s ingenuity, courage, and compassion. Through battles, problem-solving, and the ethical dilemmas inherent in time travel, the story emphasizes heroism, wisdom, and the need to protect the innocent. Doctor Who must balance cleverness, empathy, and action to restore order and ensure the safety of both Earth and the timelines he safeguards, providing a thrilling introduction to this incarnation of the legendary Time Lord.",
    "posterUrl": "https://i.ibb.co/doctorwho.jpg",
    "language": "English",
    "country": "UK",
    "addedBy": "user@example.com"
  }
]
